USE master;
GO

-- Nếu DB tồn tại thì mới đưa về SINGLE_USER và DROP
IF DB_ID('PBL3aDB') IS NOT NULL
BEGIN
    ALTER DATABASE PBL3aDB SET SINGLE_USER WITH ROLLBACK IMMEDIATE;
    DROP DATABASE PBL3aDB;
END
GO

-- Tạo lại DB
CREATE DATABASE PBL3aDB;
GO

USE PBL3aDB;
GO

-- Xóa bảng theo đúng thứ tự quan hệ khóa ngoại
-- Xóa bảng theo đúng thứ tự quan hệ khóa ngoại (Xóa bảng con trước, bảng cha sau)
IF OBJECT_ID('dbo.Registration', 'U') IS NOT NULL DROP TABLE dbo.Registration;
IF OBJECT_ID('dbo.ClassSchedule', 'U') IS NOT NULL DROP TABLE dbo.ClassSchedule;
IF OBJECT_ID('dbo.KhoanChi', 'U') IS NOT NULL DROP TABLE dbo.KhoanChi;
IF OBJECT_ID('dbo.KhoanThu', 'U') IS NOT NULL DROP TABLE dbo.KhoanThu;
IF OBJECT_ID('dbo.LuongGV', 'U') IS NOT NULL DROP TABLE dbo.LuongGV;
IF OBJECT_ID('dbo.HocPhi', 'U') IS NOT NULL DROP TABLE dbo.HocPhi;
IF OBJECT_ID('dbo.Attendance', 'U') IS NOT NULL DROP TABLE dbo.Attendance;
IF OBJECT_ID('dbo.Diem', 'U') IS NOT NULL DROP TABLE dbo.Diem;
IF OBJECT_ID('JoinClass', 'U') IS NOT NULL DROP TABLE JoinClass;
IF OBJECT_ID('teacherInfo', 'U') IS NOT NULL DROP TABLE teacherInfo;
IF OBJECT_ID('Class', 'U') IS NOT NULL DROP TABLE Class;
IF OBJECT_ID('accountList', 'U') IS NOT NULL DROP TABLE accountList;
GO

-- Tạo bảng accountList
CREATE TABLE accountList (
    Id NVARCHAR(20) PRIMARY KEY,
    username NVARCHAR(100) NOT NULL,
    Password NVARCHAR(100) NOT NULL,
    name NVARCHAR(100) NOT NULL,
    phone NVARCHAR(20),
    dateOfBirth DATE,
    sex NVARCHAR(10),
    Role NVARCHAR(20) NOT NULL,
    status NVARCHAR(30) DEFAULT N'Hoạt động'
);
GO

-- Dữ liệu mẫu accountList
INSERT INTO accountList
(Id, username, Password, name, phone, dateOfBirth, sex, Role)
VALUES
-- ================= ADMIN =================
('A001','adminC','123456','Admin Chung','0900000001','1990-01-01','Male','AdminC'),
('A002','adminTC','123456','Admin Tai Chinh','0900000002','1991-02-02','Female','AdminTC'),
('A003','adminDD','123456','Admin Diem Danh','0900000003','1992-03-03','Male','AdminDD'),


-- ================= TEACHER =================
-- GV Toán -> ID: (Txx)
('T01', 'T01', '123456', N'Bùi Quốc Cường', '0909985454', '1975-09-23', 'Male', 'Teacher'),
('T02', 'T02', '123456', N'Đặng Xuân Thảo', '0908281844', '1992-03-24', 'Female', 'Teacher'),
('T03', 'T03', '123456', N'Đặng Hữu Long', '0338876057', '1988-02-18', 'Male', 'Teacher'),
('T04', 'T04', '123456', N'Hoàng Như Nhi', '0707941058', '1976-05-03', 'Female', 'Teacher'),
('T05', 'T05', '123456', N'Nguyễn Văn Hiếu', '0825723344', '1989-09-22', 'Male', 'Teacher'),
('T06', 'T06', '123456', N'Võ Mai Nhung', '0764428409', '1972-08-03', 'Female', 'Teacher'),
('T07', 'T07', '123456', N'Lý Gia Phong', '0897540769', '1971-01-17', 'Male', 'Teacher'),
('T08', 'T08', '123456', N'Võ Khắc Huy', '0912906114', '1979-06-24', 'Male', 'Teacher'),
('T09', 'T09', '123456', N'Ngô Thị Duyên', '0772367295', '1972-03-30', 'Female', 'Teacher'),
('T10', 'T10', '123456', N'Bùi Thu Tiên', '0880179521', '1978-08-15', 'Female', 'Teacher'),
('T11', 'T11', '123456', N'Đặng Quỳnh Ngân', '0842418692', '1987-10-01', 'Female', 'Teacher'),
('T12', 'T12', '123456', N'Phan Kim Châu', '0983126297', '1977-04-03', 'Female', 'Teacher'),
('T13', 'T13', '123456', N'Tô Thanh Hiếu', '0790064763', '1988-08-18', 'Male', 'Teacher'),
('T14', 'T14', '123456', N'Hoàng Minh Nga', '0369769700', '1975-11-30', 'Female', 'Teacher'),
('T15', 'T15', '123456', N'Hoàng Hồng Ngân', '0820159059', '1979-05-25', 'Female', 'Teacher'),
('T16', 'T16', '123456', N'Lý Ngọc Phong', '0837321883', '1972-10-18', 'Male', 'Teacher'),
('T17', 'T17', '123456', N'Võ Thanh Nhung', '0918670423', '1976-02-29', 'Female', 'Teacher'),
('T18', 'T18', '123456', N'Lý Thanh Huy', '0338162234', '1970-09-11', 'Male', 'Teacher'),
('T19', 'T19', '123456', N'Huỳnh Xuân Nhi', '0851247585', '1981-03-22', 'Female', 'Teacher'),
('T20', 'T20', '123456', N'Hồ Hải Tâm', '0368121396', '1990-03-10', 'Male', 'Teacher'),

-- GV Văn -> ID: (Vxx)
('V01', 'V01', '123456', N'Vũ Đức Cường', '0981644079', '1993-01-06', 'Male', 'Teacher'),
('V02', 'V02', '123456', N'Hồ Gia Tuấn', '0979905479', '1979-05-26', 'Male', 'Teacher'),
('V03', 'V03', '123456', N'Đỗ Thúy Hoa', '0779312349', '1976-05-13', 'Female', 'Teacher'),
('V04', 'V04', '123456', N'Hồ Đình Bảo', '0328843425', '1994-11-09', 'Male', 'Teacher'),
('V05', 'V05', '123456', N'Dương Công Thành', '0989258446', '1980-12-01', 'Male', 'Teacher'),
('V06', 'V06', '123456', N'Đỗ Gia Kiên', '0942893762', '1994-06-19', 'Male', 'Teacher'),
('V07', 'V07', '123456', N'Đặng Thúy Khanh', '0880366552', '1991-10-13', 'Female', 'Teacher'),
('V08', 'V08', '123456', N'Hoàng Kim Yến', '0912270225', '1982-05-01', 'Female', 'Teacher'),
('V09', 'V09', '123456', N'Đỗ Đức Đạt', '0376117222', '1993-10-25', 'Male', 'Teacher'),
('V10', 'V10', '123456', N'Đoàn Kim Quyên', '0381654350', '1990-11-21', 'Female', 'Teacher'),
('V11', 'V11', '123456', N'Nguyễn Ngọc Hiền', '0973628516', '1971-09-26', 'Female', 'Teacher'),
('V12', 'V12', '123456', N'Đoàn Quang Thiên', '0908485636', '1983-08-16', 'Male', 'Teacher'),
('V13', 'V13', '123456', N'Huỳnh Ngọc Sơn', '0845818742', '1974-05-21', 'Male', 'Teacher'),
('V14', 'V14', '123456', N'Lê Quỳnh Yến', '0938572968', '1974-10-28', 'Female', 'Teacher'),
('V15', 'V15', '123456', N'Hồ Kiều Huyền', '0340962243', '1979-11-29', 'Female', 'Teacher'),
('V16', 'V16', '123456', N'Đoàn Thị Hà', '0837972846', '1983-01-01', 'Female', 'Teacher'),
('V17', 'V17', '123456', N'Đinh Bích Ly', '0830257273', '1981-04-13', 'Female', 'Teacher'),
('V18', 'V18', '123456', N'Nguyễn Đức Thành', '0839217385', '1977-05-23', 'Male', 'Teacher'),
('V19', 'V19', '123456', N'Phan Thị An', '0830538612', '1984-01-22', 'Female', 'Teacher'),
('V20', 'V20', '123456', N'Đoàn Thành Cường', '0830499232', '1994-06-06', 'Male', 'Teacher'),

-- GV Hóa -> ID: (Hxx)
('H01', 'H01', '123456', N'Lê Đình Tuấn', '0395186113', '1995-03-18', 'Male', 'Teacher'),
('H02', 'H02', '123456', N'Bùi Hữu Phong', '0702676780', '1989-08-04', 'Male', 'Teacher'),
('H03', 'H03', '123456', N'Bùi Gia Bảo', '0792010655', '1977-09-13', 'Male', 'Teacher'),
('H04', 'H04', '123456', N'Bùi Đức Cường', '0764781830', '1996-11-16', 'Male', 'Teacher'),
('H05', 'H05', '123456', N'Phan Thúy Ngọc', '0916373726', '1974-01-25', 'Female', 'Teacher'),
('H06', 'H06', '123456', N'Ngô Ngọc Quyên', '0811459786', '1981-07-03', 'Female', 'Teacher'),
('H07', 'H07', '123456', N'Đặng Xuân Lộc', '0332276353', '1980-12-27', 'Male', 'Teacher'),
('H08', 'H08', '123456', N'Trần Thanh An', '0898491995', '1992-12-30', 'Female', 'Teacher'),
('H09', 'H09', '123456', N'Vũ Minh Dung', '0341774422', '1972-06-11', 'Female', 'Teacher'),
('H10', 'H10', '123456', N'Nguyễn Khắc Phúc', '0828849685', '1970-07-08', 'Male', 'Teacher'),
('H11', 'H11', '123456', N'Võ Xuân Quỳnh', '0768915472', '1980-09-26', 'Female', 'Teacher'),
('H12', 'H12', '123456', N'Võ Ngọc Trang', '0379663552', '1993-11-07', 'Female', 'Teacher'),
('H13', 'H13', '123456', N'Hồ Khắc Lộc', '0818903589', '1984-07-21', 'Male', 'Teacher'),
('H14', 'H14', '123456', N'Đặng Hữu Huy', '0398252610', '1989-12-14', 'Male', 'Teacher'),
('H15', 'H15', '123456', N'Đỗ Mỹ Trâm', '0386723048', '1971-02-24', 'Female', 'Teacher'),
('H16', 'H16', '123456', N'Đoàn Mai Thi', '0944627483', '1994-07-27', 'Female', 'Teacher'),
('H17', 'H17', '123456', N'Nguyễn Thanh Anh', '0356639925', '1978-06-21', 'Male', 'Teacher'),
('H18', 'H18', '123456', N'Huỳnh Lan Nga', '0336183412', '1983-06-20', 'Female', 'Teacher'),
('H19', 'H19', '123456', N'Lý Kiều Uyên', '0361276572', '1993-03-23', 'Female', 'Teacher'),
('H20', 'H20', '123456', N'Hồ Kim Ly', '0765011181', '1970-06-04', 'Female', 'Teacher'),

-- GV Lý -> ID: (Lxx)
('L01', 'L01', '123456', N'Đặng Quốc Bảo', '0372749898', '1992-10-10', 'Male', 'Teacher'),
('L02', 'L02', '123456', N'Nguyễn Văn An', '0344986616', '1979-12-08', 'Male', 'Teacher'),
('L03', 'L03', '123456', N'Nguyễn Gia Phong', '0978863171', '1991-08-08', 'Male', 'Teacher'),
('L04', 'L04', '123456', N'Phạm Gia Thành', '0768938892', '1982-06-03', 'Male', 'Teacher'),
('L05', 'L05', '123456' ,N'Phan Minh Thắng', '0776651838', '1978-05-31', 'Male', 'Teacher'),
('L06', 'L06', '123456', N'Ngô Ngọc Nhi', '0364232991', '1982-02-17', 'Female', 'Teacher'),
('L07', 'L07', '123456', N'Ngô Quốc Hoàng', '0785280373', '1976-11-03', 'Male', 'Teacher'),
('L08', 'L08', '123456', N'Trần Minh Minh', '0325400546', '1990-08-25', 'Male', 'Teacher'),
('L09', 'L09', '123456', N'Lý Thị Nhung', '0365084303', '1980-04-30', 'Female', 'Teacher'),
('L10', 'L10', '123456', N'Bùi Thu Hà', '0811032370', '1992-03-23', 'Female', 'Teacher'),
('L11', 'L11', '123456', N'Nguyễn Thu Thu', '0375319524', '1979-10-25', 'Female', 'Teacher'),
('L12', 'L12', '123456', N'Hoàng Thị Tiên', '0785858871', '1980-08-30', 'Female', 'Teacher'),
('L13', 'L13', '123456', N'Vũ Đức Lâm', '0326839199', '1972-08-21', 'Male', 'Teacher'),
('L14', 'L14', '123456', N'Hoàng Thị Dung', '0389563544', '1992-01-09', 'Female', 'Teacher'),
('L15', 'L15', '123456', N'Ngô Khắc Nam', '0820811493', '1973-12-15', 'Male', 'Teacher'),
('L16', 'L16', '123456', N'Hoàng Văn Tâm', '0352548097', '1973-01-13', 'Male', 'Teacher'),
('L17', 'L17', '123456', N'Ngô Hồng Chi', '0705443097', '1970-03-07', 'Female', 'Teacher'),
('L18', 'L18', '123456', N'Lê Thanh Vy', '0915247885', '1991-10-16', 'Female', 'Teacher'),
('L19', 'L19', '123456', N'Huỳnh Thành Đạt', '0887124436', '1979-07-20', 'Male', 'Teacher'),
('L20', 'L20', '123456', N'Đỗ Khắc Lâm', '0909201150', '1982-07-21', 'Male', 'Teacher'),

-- GV Sinh -> ID: (Sxx)
('S01', 'S01', '123456', N'Phạm Xuân Châu', '0375022285', '1979-05-21', 'Female', 'Teacher'),
('S02', 'S02', '123456', N'Đỗ Đức Hùng', '0932031636', '1994-10-30', 'Male', 'Teacher'),
('S03', 'S03', '123456', N'Đặng Nhật Phong', '0366268989', '1991-02-15', 'Male', 'Teacher'),
('S04', 'S04', '123456', N'Bùi Hữu Dũng', '0392888933', '1997-11-25', 'Male', 'Teacher'),
('S05', 'S05', '123456', N'Lê Thu Ngân', '0898182225', '1971-12-20', 'Female', 'Teacher'),
('S06', 'S06', '123456', N'Huỳnh Bích Yến', '0362396409', '1988-09-29', 'Female', 'Teacher'),
('S07', 'S07', '123456', N'Dương Thị Mai', '0979654451', '1990-04-16', 'Female', 'Teacher'),
('S08', 'S08', '123456', N'Lê Kim Duyên', '0824229034', '1976-04-24', 'Female', 'Teacher'),
('S09', 'S09', '123456', N'Võ Thành Sơn', '0989159426', '1983-09-10', 'Male', 'Teacher'),
('S10', 'S10', '123456', N'Tô Xuân Băng', '0382660824', '1979-04-03', 'Female', 'Teacher'),
('S11', 'S11', '123456', N'Phan Kim Vân', '0908119776', '1978-11-03', 'Female', 'Teacher'),
('S12', 'S12', '123456', N'Lý Xuân Lâm', '0822230133', '1987-07-19', 'Male', 'Teacher'),
('S13', 'S13', '123456', N'Đào Diễm Vân', '0768075335', '1983-05-24', 'Female', 'Teacher'),
('S14', 'S14', '123456', N'Dương Quỳnh Vân', '0980327830', '1978-01-06', 'Female', 'Teacher'),
('S15', 'S15', '123456', N'Ngô Đình Tuấn', '0844519253', '1990-01-21', 'Male', 'Teacher'),
('S16', 'S16', '123456', N'Trần Tuấn Nam', '0821919733', '1972-05-22', 'Male', 'Teacher'),
('S17', 'S17', '123456', N'Huỳnh Xuân An', '0980532698', '1992-05-24', 'Male', 'Teacher'),
('S18', 'S18', '123456', N'Huỳnh Khắc Lâm', '0836702074', '1980-09-08', 'Male', 'Teacher'),
('S19', 'S19', '123456', N'Bùi Hồng Nhi', '0703309133', '1975-06-07', 'Female', 'Teacher'),
('S20', 'S20', '123456', N'Vũ Bích Ngân', '0889183302', '1984-01-26', 'Female', 'Teacher'),

-- GV Anh -> ID: (NNAxx)
('NNA01', 'NNA01', '123456', N'Lê Thúy Châu', '0353842216', '1983-08-29', 'Female', 'Teacher'),
('NNA02', 'NNA02', '123456', N'Nguyễn Hữu Hoàng', '0372369960', '1982-10-09', 'Male', 'Teacher'),
('NNA03', 'NNA03', '123456', N'Trần Thị Châu', '0948907417', '1985-06-23', 'Female', 'Teacher'),
('NNA04', 'NNA04', '123456', N'Đỗ Nhật An', '0909539032', '1975-11-10', 'Male', 'Teacher'),
('NNA05', 'NNA05', '123456', N'Bùi Quốc Hùng', '0973669512', '1983-01-04', 'Male', 'Teacher'),
('NNA06', 'NNA06', '123456', N'Lý Ngọc Khang', '0791340561', '1977-11-14', 'Male', 'Teacher'),
('NNA07', 'NNA07', '123456', N'Huỳnh Diễm Anh', '0702354931', '1983-10-10', 'Female', 'Teacher'),
('NNA08', 'NNA08', '123456', N'Dương Kim Mai', '0912652196', '1988-02-10', 'Female', 'Teacher'),
('NNA09', 'NNA09', '123456', N'Ngô Đình Cường', '0359940925', '1994-04-06', 'Male', 'Teacher'),
('NNA10', 'NNA10', '123456', N'Hoàng Kiều An', '0340147332', '1987-11-26', 'Female', 'Teacher'),
('NNA11', 'NNA11', '123456', N'Vũ Hồng Phong', '0391450583', '1970-07-29', 'Male', 'Teacher'),
('NNA12', 'NNA12', '123456', N'Nguyễn Xuân Dũng', '0389473900', '1970-05-27', 'Male', 'Teacher'),
('NNA13', 'NNA13', '123456', N'Võ Trúc Vy', '0356765588', '1987-08-26', 'Female', 'Teacher'),
('NNA14', 'NNA14', '123456', N'Đỗ Thành Nam', '0327208484', '1979-10-01', 'Male', 'Teacher'),
('NNA15', 'NNA15', '123456', N'Tô Trúc Yến', '0902561093', '1985-07-20', 'Female', 'Teacher'),
('NNA16', 'NNA16', '123456', N'Lý Ngọc Vy', '0364448594', '1971-10-16', 'Female', 'Teacher'),
('NNA17', 'NNA17', '123456', N'Hoàng Văn Tâm', '0766544546', '1972-10-18', 'Male', 'Teacher'),
('NNA18', 'NNA18', '123456', N'Lý Khắc Vinh', '0811885477', '1991-08-22', 'Male', 'Teacher'),
('NNA19', 'NNA19', '123456', N'Bùi Văn Trung', '0858074386', '1970-09-06', 'Male', 'Teacher'),
('NNA20', 'NNA20', '123456', N'Lê Thanh Hiền', '0774894084', '1990-02-07', 'Female', 'Teacher'),

-- GV Nhật -> ID: (NNNxx)
('NNN01', 'NNN01', '123456', N'Phạm Kiều Đào', '0981476873', '1976-06-24', 'Female', 'Teacher'),
('NNN02', 'NNN02', '123456', N'Trần Minh Thảo', '0779533089', '1991-05-24', 'Female', 'Teacher'),
('NNN03', 'NNN03', '123456', N'Trần Ngọc Oanh', '0788082615', '1983-12-30', 'Female', 'Teacher'),
('NNN04', 'NNN04', '123456', N'Phạm Diễm Hiền', '0904252776', '1993-01-28', 'Female', 'Teacher'),
('NNN05', 'NNN05', '123456', N'Huỳnh Thanh Hân', '0798520852', '1975-12-18', 'Female', 'Teacher'),
('NNN06', 'NNN06', '123456', N'Hoàng Hồng Nhung', '0798189555', '1977-07-20', 'Female', 'Teacher'),
('NNN07', 'NNN07', '123456', N'Lê Mai Ngân', '0336119742', '1995-01-10', 'Female', 'Teacher'),
('NNN08', 'NNN08', '123456', N'Trần Thu Hương', '0336627198', '1971-10-31', 'Female', 'Teacher'),
('NNN09', 'NNN09', '123456', N'Tô Minh Thảo', '0832885110', '1982-07-29', 'Female', 'Teacher'),
('NNN10', 'NNN10', '123456', N'Đào Khắc Tuấn', '0366048563', '1972-12-06', 'Male', 'Teacher'),
('NNN11', 'NNN11', '123456', N'Tô Kim Ngân', '0368155771', '1984-02-05', 'Female', 'Teacher'),
('NNN12', 'NNN12', '123456', N'Dương Thành Quân', '0380380947', '1992-09-25', 'Male', 'Teacher'),
('NNN13', 'NNN13', '123456', N'Hồ Xuân Tú', '0354272242', '1974-08-30', 'Female', 'Teacher'),
('NNN14', 'NNN14', '123456', N'Huỳnh Quang Bình', '0336531739', '1990-10-27', 'Male', 'Teacher'),
('NNN15', 'NNN15', '123456', N'Đỗ Quang Long', '0883349263', '1984-07-20', 'Male', 'Teacher'),
('NNN16', 'NNN16', '123456', N'Đinh Bích Nga', '0937073889', '1992-04-26', 'Female', 'Teacher'),
('NNN17', 'NNN17', '123456', N'Phan Hồng Yến', '0911441370', '1982-05-10', 'Female', 'Teacher'),
('NNN18', 'NNN18', '123456', N'Hoàng Quang Thắng', '0760264039', '1974-11-16', 'Male', 'Teacher'),
('NNN19', 'NNN19', '123456', N'Lý Thanh Duyên', '0848495489', '1995-11-26', 'Female', 'Teacher'),
('NNN20', 'NNN20', '123456', N'Trần Lan Trang', '0325158466', '1974-11-03', 'Female', 'Teacher'),

-- GV Trung -> ID: (NNTxx)
('NNT01', 'NNT01', '123456', N'Lê Xuân Yến', '0396311328', '1985-03-27', 'Female', 'Teacher'),
('NNT02', 'NNT02', '123456', N'Nguyễn Thị Châu', '0347389124', '1987-08-18', 'Female', 'Teacher'),
('NNT03', 'NNT03', '123456', N'Đỗ Văn Nam', '0947739278', '1993-05-31', 'Male', 'Teacher'),
('NNT04', 'NNT04', '123456', N'Đỗ Minh Thảo', '0908476322', '1979-04-08', 'Female', 'Teacher'),
('NNT05', 'NNT05', '123456', N'Đặng Thái Minh', '0387492280', '1986-02-08', 'Male', 'Teacher'),
('NNT06', 'NNT06', '123456', N'Phạm Khắc Phúc', '0366884508', '1970-11-21', 'Male', 'Teacher'),
('NNT07', 'NNT07', '123456', N'Huỳnh Ngọc Nhi', '0909094539', '1993-02-11', 'Female', 'Teacher'),
('NNT08', 'NNT08', '123456', N'Phạm Kiều Vy', '0945955948', '1992-08-29', 'Female', 'Teacher'),
('NNT09', 'NNT09', '123456', N'Hoàng Minh Tú', '0845786067', '1971-03-26', 'Female', 'Teacher'),
('NNT10', 'NNT10', '123456', N'Đặng Hồng Hân', '0884457764', '1987-12-19', 'Female', 'Teacher'),
('NNT11', 'NNT11', '123456', N'Trần Xuân Tùng', '0949992012', '1987-03-04', 'Male', 'Teacher'),
('NNT12', 'NNT12', '123456', N'Dương Lan Duyên', '0892377043', '1970-01-22', 'Female', 'Teacher'),
('NNT13', 'NNT13', '123456', N'Đỗ Thanh Uyên', '0981574927', '1974-12-01', 'Female', 'Teacher'),
('NNT14', 'NNT14', '123456', N'Hoàng Hồng Nghĩa', '0930716456', '1987-08-26', 'Male', 'Teacher'),
('NNT15', 'NNT15', '123456', N'Phạm Quang Hoàng', '0798442412', '1985-04-19', 'Male', 'Teacher'),
('NNT16', 'NNT16', '123456', N'Vũ Ngọc Yến', '0704859930', '1974-05-28', 'Female', 'Teacher'),
('NNT17', 'NNT17', '123456', N'Hồ Hồng Thu', '0942076967', '1982-12-31', 'Female', 'Teacher'),
('NNT18', 'NNT18', '123456', N'Hồ Đức Lâm', '0799845585', '1995-08-13', 'Male', 'Teacher'),
('NNT19', 'NNT19', '123456', N'Hồ Tuấn Phúc', '0937722810', '1985-02-22', 'Male', 'Teacher'),
('NNT20', 'NNT20', '123456', N'Huỳnh Trúc Hương', '0337873388', '1992-02-28', 'Female', 'Teacher'),



-- ================= NỮ (MÃ 101) =================
-- Khóa 2009
('10109001', '10109001', '123456', N'Nguyễn Thị Anh', '0910109001', '2009-01-10', 'Female', 'Student'),
('10109002', '10109002', '123456', N'Lê Ngọc Bích', '0910109002', '2009-02-15', 'Female', 'Student'),
('10109003', '10109003', '123456', N'Trần Thu Châu', '0910109003', '2009-03-20', 'Female', 'Student'),
('10109004', '10109004', '123456', N'Phạm Mai Dung', '0910109004', '2009-04-05', 'Female', 'Student'),
('10109005', '10109005', '123456', N'Vũ Thanh Hà', '0910109005', '2009-05-12', 'Female', 'Student'),
('10109006', '10109006', '123456', N'Đặng Bích Ngọc', '0910109006', '2009-06-25', 'Female', 'Student'),
('10109007', '10109007', '123456', N'Hồ Trúc Đào', '0910109007', '2009-07-08', 'Female', 'Student'),
('10109008', '10109008', '123456', N'Hoàng Mai Lan', '0910109008', '2009-08-30', 'Female', 'Student'),
('10109009', '10109009', '123456', N'Phan Thị Mơ', '0910109009', '2009-09-14', 'Female', 'Student'),
('10109010', '10109010', '123456', N'Đỗ Thu Hương', '0910109010', '2009-10-18', 'Female', 'Student'),
('10109011', '10109011', '123456', N'Nguyễn Thanh Mai', '0910109011', '2009-11-02', 'Female', 'Student'),
('10109012', '10109012', '123456', N'Lê Thu Trang', '0910109012', '2009-12-15', 'Female', 'Student'),
('10109013', '10109013', '123456', N'Trần Ngọc Anh', '0910109013', '2009-01-22', 'Female', 'Student'),
('10109014', '10109014', '123456', N'Phạm Thanh Thảo', '0910109014', '2009-02-18', 'Female', 'Student'),
('10109015', '10109015', '123456', N'Vũ Minh Châu', '0910109015', '2009-03-09', 'Female', 'Student'),
('10109016', '10109016', '123456', N'Đặng Thu Hà', '0910109016', '2009-04-27', 'Female', 'Student'),
('10109017', '10109017', '123456', N'Hoàng Ngọc Lan', '0910109017', '2009-05-19', 'Female', 'Student'),
('10109018', '10109018', '123456', N'Phan Thanh Huyền', '0910109018', '2009-06-11', 'Female', 'Student'),
('10109019', '10109019', '123456', N'Đỗ Bích Ngọc', '0910109019', '2009-07-03', 'Female', 'Student'),
('10109020', '10109020', '123456', N'Bùi Thu Hằng', '0910109020', '2009-08-25', 'Female', 'Student'),
('10109021', '10109021', '123456', N'Nguyễn Minh Phương', '0910109021', '2009-09-07', 'Female', 'Student'),
('10109022', '10109022', '123456', N'Lê Thị Kim', '0910109022', '2009-10-12', 'Female', 'Student'),
('10109023', '10109023', '123456', N'Trần Mai Anh', '0910109023', '2009-11-28', 'Female', 'Student'),
('10109024', '10109024', '123456', N'Phạm Ngọc Diệp', '0910109024', '2009-12-03', 'Female', 'Student'),
('10109025', '10109025', '123456', N'Vũ Thu Thủy', '0910109025', '2009-01-17', 'Female', 'Student'),
('10109026', '10109026', '123456', N'Đặng Kim Chi', '0910109026', '2009-02-09', 'Female', 'Student'),
('10109027', '10109027', '123456', N'Hoàng Bích Trâm', '0910109027', '2009-03-30', 'Female', 'Student'),
('10109028', '10109028', '123456', N'Phan Thu Hà', '0910109028', '2009-04-14', 'Female', 'Student'),
('10109029', '10109029', '123456', N'Đỗ Mai Phương', '0910109029', '2009-05-26', 'Female', 'Student'),
('10109030', '10109030', '123456', N'Bùi Ngọc Anh', '0910109030', '2009-06-08', 'Female', 'Student'),
('10109031', '10109031', '123456', N'Nguyễn Thu Nga', '0910109031', '2009-07-21', 'Female', 'Student'),
('10109032', '10109032', '123456', N'Lê Minh Tâm', '0910109032', '2009-08-13', 'Female', 'Student'),
('10109033', '10109033', '123456', N'Trần Thanh Vân', '0910109033', '2009-09-29', 'Female', 'Student'),
('10109034', '10109034', '123456', N'Phạm Thu Cúc', '0910109034', '2009-10-05', 'Female', 'Student'),
('10109035', '10109035', '123456', N'Vũ Ngọc Bích', '0910109035', '2009-11-16', 'Female', 'Student'),
('10109036', '10109036', '123456', N'Đặng Thị Hoa', '0910109036', '2009-12-22', 'Female', 'Student'),
('10109037', '10109037', '123456', N'Hoàng Thanh Nhàn', '0910109037', '2009-01-11', 'Female', 'Student'),
('10109038', '10109038', '123456', N'Phan Kim Oanh', '0910109038', '2009-02-24', 'Female', 'Student'),
('10109039', '10109039', '123456', N'Đỗ Thu Yến', '0910109039', '2009-03-18', 'Female', 'Student'),
('10109040', '10109040', '123456', N'Bùi Minh Châu', '0910109040', '2009-04-06', 'Female', 'Student'),
('10109041', '10109041', '123456', N'Nguyễn Thanh Hiền', '0910109041', '2009-05-15', 'Female', 'Student'),
('10109042', '10109042', '123456', N'Lê Thu Hiền', '0910109042', '2009-06-27', 'Female', 'Student'),
('10109043', '10109043', '123456', N'Trần Ngọc Mai', '0910109043', '2009-07-09', 'Female', 'Student'),
('10109044', '10109044', '123456', N'Phạm Thu Linh', '0910109044', '2009-08-20', 'Female', 'Student'),
('10109045', '10109045', '123456', N'Vũ Thanh Tâm', '0910109045', '2009-09-11', 'Female', 'Student'),
('10109046', '10109046', '123456', N'Đặng Minh Nguyệt', '0910109046', '2009-10-30', 'Female', 'Student'),
('10109047', '10109047', '123456', N'Hoàng Thu Thảo', '0910109047', '2009-11-08', 'Female', 'Student'),
('10109048', '10109048', '123456', N'Phan Bích Liên', '0910109048', '2009-12-19', 'Female', 'Student'),
('10109049', '10109049', '123456', N'Đỗ Ngọc Hà', '0910109049', '2009-01-28', 'Female', 'Student'),
('10109050', '10109050', '123456', N'Bùi Thu Trang', '0910109050', '2009-02-06', 'Female', 'Student'),

-- Khóa 2010
('10110001', '10110001', '123456', N'Nguyễn Tú Anh', '0910110001', '2010-01-11', 'Female', 'Student'),
('10110002', '10110002', '123456', N'Lê Bảo Bình', '0910110002', '2010-02-16', 'Female', 'Student'),
('10110003', '10110003', '123456', N'Trần Kim Chi', '0910110003', '2010-03-21', 'Female', 'Student'),
('10110004', '10110004', '123456', N'Phạm Mỹ Duyên', '0910110004', '2010-04-06', 'Female', 'Student'),
('10110005', '10110005', '123456', N'Vũ Thu Hiền', '0910110005', '2010-05-13', 'Female', 'Student'),
('10110006', '10110006', '123456', N'Đặng Ngọc Mai', '0910110006', '2010-06-26', 'Female', 'Student'),
('10110007', '10110007', '123456', N'Hồ Yến Nhi', '0910110007', '2010-07-09', 'Female', 'Student'),
('10110008', '10110008', '123456', N'Hoàng Kiều Oanh', '0910110008', '2010-08-31', 'Female', 'Student'),
('10110009', '10110009', '123456', N'Phan Diễm Quỳnh', '0910110009', '2010-09-15', 'Female', 'Student'),
('10110010', '10110010', '123456', N'Đỗ Thanh Thảo', '0910110010', '2010-10-19', 'Female', 'Student'),
('10110011', '10110011', '123456', N'Nguyễn Thu Trang', '0910110011', '2010-11-03', 'Female', 'Student'),
('10110012', '10110012', '123456', N'Lê Ngọc Hân', '0910110012', '2010-12-17', 'Female', 'Student'),
('10110013', '10110013', '123456', N'Trần Mai Phương', '0910110013', '2010-01-23', 'Female', 'Student'),
('10110014', '10110014', '123456', N'Phạm Thanh Huyền', '0910110014', '2010-02-19', 'Female', 'Student'),
('10110015', '10110015', '123456', N'Vũ Minh Thư', '0910110015', '2010-03-10', 'Female', 'Student'),
('10110016', '10110016', '123456', N'Đặng Thu Hà', '0910110016', '2010-04-28', 'Female', 'Student'),
('10110017', '10110017', '123456', N'Hoàng Ngọc Ánh', '0910110017', '2010-05-20', 'Female', 'Student'),
('10110018', '10110018', '123456', N'Phan Thanh Tâm', '0910110018', '2010-06-12', 'Female', 'Student'),
('10110019', '10110019', '123456', N'Đỗ Bích Hạnh', '0910110019', '2010-07-04', 'Female', 'Student'),
('10110020', '10110020', '123456', N'Bùi Thu Hà', '0910110020', '2010-08-26', 'Female', 'Student'),
('10110021', '10110021', '123456', N'Nguyễn Minh Châu', '0910110021', '2010-09-08', 'Female', 'Student'),
('10110022', '10110022', '123456', N'Lê Thị Hồng', '0910110022', '2010-10-13', 'Female', 'Student'),
('10110023', '10110023', '123456', N'Trần Ngọc Diệp', '0910110023', '2010-11-29', 'Female', 'Student'),
('10110024', '10110024', '123456', N'Phạm Thu Thủy', '0910110024', '2010-12-04', 'Female', 'Student'),
('10110025', '10110025', '123456', N'Vũ Kim Ngân', '0910110025', '2010-01-18', 'Female', 'Student'),
('10110026', '10110026', '123456', N'Đặng Bích Ngọc', '0910110026', '2010-02-10', 'Female', 'Student'),
('10110027', '10110027', '123456', N'Hoàng Thu Thảo', '0910110027', '2010-03-31', 'Female', 'Student'),
('10110028', '10110028', '123456', N'Phan Mỹ Linh', '0910110028', '2010-04-15', 'Female', 'Student'),
('10110029', '10110029', '123456', N'Đỗ Mai Anh', '0910110029', '2010-05-27', 'Female', 'Student'),
('10110030', '10110030', '123456', N'Bùi Ngọc Trâm', '0910110030', '2010-06-09', 'Female', 'Student'),
('10110031', '10110031', '123456', N'Nguyễn Thu Hương', '0910110031', '2010-07-22', 'Female', 'Student'),
('10110032', '10110032', '123456', N'Lê Minh Anh', '0910110032', '2010-08-14', 'Female', 'Student'),
('10110033', '10110033', '123456', N'Trần Thanh Nhàn', '0910110033', '2010-09-30', 'Female', 'Student'),
('10110034', '10110034', '123456', N'Phạm Thu Nga', '0910110034', '2010-10-06', 'Female', 'Student'),
('10110035', '10110035', '123456', N'Vũ Ngọc Hà', '0910110035', '2010-11-17', 'Female', 'Student'),
('10110036', '10110036', '123456', N'Đặng Thị Lan', '0910110036', '2010-12-23', 'Female', 'Student'),
('10110037', '10110037', '123456', N'Hoàng Thanh Tâm', '0910110037', '2010-01-12', 'Female', 'Student'),
('10110038', '10110038', '123456', N'Phan Kim Anh', '0910110038', '2010-02-25', 'Female', 'Student'),
('10110039', '10110039', '123456', N'Đỗ Thu Trang', '0910110039', '2010-03-19', 'Female', 'Student'),
('10110040', '10110040', '123456', N'Bùi Minh Hằng', '0910110040', '2010-04-07', 'Female', 'Student'),
('10110041', '10110041', '123456', N'Nguyễn Thanh Thủy', '0910110041', '2010-05-16', 'Female', 'Student'),
('10110042', '10110042', '123456', N'Lê Thu Phương', '0910110042', '2010-06-28', 'Female', 'Student'),
('10110043', '10110043', '123456', N'Trần Ngọc Huyền', '0910110043', '2010-07-10', 'Female', 'Student'),
('10110044', '10110044', '123456', N'Phạm Thu Anh', '0910110044', '2010-08-21', 'Female', 'Student'),
('10110045', '10110045', '123456', N'Vũ Thanh Hằng', '0910110045', '2010-09-12', 'Female', 'Student'),
('10110046', '10110046', '123456', N'Đặng Minh Châu', '0910110046', '2010-10-31', 'Female', 'Student'),
('10110047', '10110047', '123456', N'Hoàng Thu Hà', '0910110047', '2010-11-09', 'Female', 'Student'),
('10110048', '10110048', '123456', N'Phan Bích Ngân', '0910110048', '2010-12-20', 'Female', 'Student'),
('10110049', '10110049', '123456', N'Đỗ Ngọc Mai', '0910110049', '2010-01-29', 'Female', 'Student'),
('10110050', '10110050', '123456', N'Bùi Thu Thảo', '0910110050', '2010-02-07', 'Female', 'Student'),

-- Khóa 2011
('10111001', '10111001', '123456', N'Nguyễn Ngọc Anh', '0910111001', '2011-01-12', 'Female', 'Student'),
('10111002', '10111002', '123456', N'Lê Như Bình', '0910111002', '2011-02-17', 'Female', 'Student'),
('10111003', '10111003', '123456', N'Trần Bảo Châu', '0910111003', '2011-03-22', 'Female', 'Student'),
('10111004', '10111004', '123456', N'Phạm Thùy Dung', '0910111004', '2011-04-07', 'Female', 'Student'),
('10111005', '10111005', '123456', N'Vũ Thùy Hoa', '0910111005', '2011-05-14', 'Female', 'Student'),
('10111006', '10111006', '123456', N'Đặng Thanh Ngọc', '0910111006', '2011-06-27', 'Female', 'Student'),
('10111007', '10111007', '123456', N'Hồ Thảo Nhi', '0910111007', '2011-07-10', 'Female', 'Student'),
('10111008', '10111008', '123456', N'Hoàng Ngọc Oanh', '0910111008', '2011-08-01', 'Female', 'Student'),
('10111009', '10111009', '123456', N'Phan Trúc Quỳnh', '0910111009', '2011-09-16', 'Female', 'Student'),
('10111010', '10111010', '123456', N'Đỗ Phương Thảo', '0910111010', '2011-10-20', 'Female', 'Student'),
('10111011', '10111011', '123456', N'Nguyễn Thu Trang', '0910111011', '2011-11-04', 'Female', 'Student'),
('10111012', '10111012', '123456', N'Lê Ngọc Hân', '0910111012', '2011-12-18', 'Female', 'Student'),
('10111013', '10111013', '123456', N'Trần Mai Phương', '0910111013', '2011-01-24', 'Female', 'Student'),
('10111014', '10111014', '123456', N'Phạm Thanh Huyền', '0910111014', '2011-02-20', 'Female', 'Student'),
('10111015', '10111015', '123456', N'Vũ Minh Thư', '0910111015', '2011-03-11', 'Female', 'Student'),
('10111016', '10111016', '123456', N'Đặng Thu Hà', '0910111016', '2011-04-29', 'Female', 'Student'),
('10111017', '10111017', '123456', N'Hoàng Ngọc Ánh', '0910111017', '2011-05-21', 'Female', 'Student'),
('10111018', '10111018', '123456', N'Phan Thanh Tâm', '0910111018', '2011-06-13', 'Female', 'Student'),
('10111019', '10111019', '123456', N'Đỗ Bích Hạnh', '0910111019', '2011-07-05', 'Female', 'Student'),
('10111020', '10111020', '123456', N'Bùi Thu Hà', '0910111020', '2011-08-27', 'Female', 'Student'),
('10111021', '10111021', '123456', N'Nguyễn Minh Châu', '0910111021', '2011-09-09', 'Female', 'Student'),
('10111022', '10111022', '123456', N'Lê Thị Hồng', '0910111022', '2011-10-14', 'Female', 'Student'),
('10111023', '10111023', '123456', N'Trần Ngọc Diệp', '0910111023', '2011-11-30', 'Female', 'Student'),
('10111024', '10111024', '123456', N'Phạm Thu Thủy', '0910111024', '2011-12-05', 'Female', 'Student'),
('10111025', '10111025', '123456', N'Vũ Kim Ngân', '0910111025', '2011-01-19', 'Female', 'Student'),
('10111026', '10111026', '123456', N'Đặng Bích Ngọc', '0910111026', '2011-02-11', 'Female', 'Student'),
('10111027', '10111027', '123456', N'Hoàng Thu Thảo', '0910111027', '2011-04-01', 'Female', 'Student'),
('10111028', '10111028', '123456', N'Phan Mỹ Linh', '0910111028', '2011-04-16', 'Female', 'Student'),
('10111029', '10111029', '123456', N'Đỗ Mai Anh', '0910111029', '2011-05-28', 'Female', 'Student'),
('10111030', '10111030', '123456', N'Bùi Ngọc Trâm', '0910111030', '2011-06-10', 'Female', 'Student'),
('10111031', '10111031', '123456', N'Nguyễn Thu Hương', '0910111031', '2011-07-23', 'Female', 'Student'),
('10111032', '10111032', '123456', N'Lê Minh Anh', '0910111032', '2011-08-15', 'Female', 'Student'),
('10111033', '10111033', '123456', N'Trần Thanh Nhàn', '0910111033', '2011-10-01', 'Female', 'Student'),
('10111034', '10111034', '123456', N'Phạm Thu Nga', '0910111034', '2011-10-07', 'Female', 'Student'),
('10111035', '10111035', '123456', N'Vũ Ngọc Hà', '0910111035', '2011-11-18', 'Female', 'Student'),
('10111036', '10111036', '123456', N'Đặng Thị Lan', '0910111036', '2011-12-24', 'Female', 'Student'),
('10111037', '10111037', '123456', N'Hoàng Thanh Tâm', '0910111037', '2011-01-13', 'Female', 'Student'),
('10111038', '10111038', '123456', N'Phan Kim Anh', '0910111038', '2011-02-26', 'Female', 'Student'),
('10111039', '10111039', '123456', N'Đỗ Thu Trang', '0910111039', '2011-03-20', 'Female', 'Student'),
('10111040', '10111040', '123456', N'Bùi Minh Hằng', '0910111040', '2011-04-08', 'Female', 'Student'),
('10111041', '10111041', '123456', N'Nguyễn Thanh Thủy', '0910111041', '2011-05-17', 'Female', 'Student'),
('10111042', '10111042', '123456', N'Lê Thu Phương', '0910111042', '2011-06-29', 'Female', 'Student'),
('10111043', '10111043', '123456', N'Trần Ngọc Huyền', '0910111043', '2011-07-11', 'Female', 'Student'),
('10111044', '10111044', '123456', N'Phạm Thu Anh', '0910111044', '2011-08-22', 'Female', 'Student'),
('10111045', '10111045', '123456', N'Vũ Thanh Hằng', '0910111045', '2011-09-13', 'Female', 'Student'),
('10111046', '10111046', '123456', N'Đặng Minh Châu', '0910111046', '2011-11-01', 'Female', 'Student'),
('10111047', '10111047', '123456', N'Hoàng Thu Hà', '0910111047', '2011-11-10', 'Female', 'Student'),
('10111048', '10111048', '123456', N'Phan Bích Ngân', '0910111048', '2011-12-21', 'Female', 'Student'),
('10111049', '10111049', '123456', N'Đỗ Ngọc Mai', '0910111049', '2011-01-30', 'Female', 'Student'),
('10111050', '10111050', '123456', N'Bùi Thu Thảo', '0910111050', '2011-02-08', 'Female', 'Student'),

-- Khóa 2012
('10112001', '10112001', '123456', N'Nguyễn Quỳnh Anh', '0910112001', '2012-01-13', 'Female', 'Student'),
('10112002', '10112002', '123456', N'Lê Thanh Bình', '0910112002', '2012-02-18', 'Female', 'Student'),
('10112003', '10112003', '123456', N'Trần Minh Châu', '0910112003', '2012-03-23', 'Female', 'Student'),
('10112004', '10112004', '123456', N'Phạm Ngọc Dung', '0910112004', '2012-04-08', 'Female', 'Student'),
('10112005', '10112005', '123456', N'Vũ Ngọc Hoa', '0910112005', '2012-05-15', 'Female', 'Student'),
('10112006', '10112006', '123456', N'Đặng Xuân Ngọc', '0910112006', '2012-06-28', 'Female', 'Student'),
('10112007', '10112007', '123456', N'Hồ Tú Nhi', '0910112007', '2012-07-11', 'Female', 'Student'),
('10112008', '10112008', '123456', N'Hoàng Tú Oanh', '0910112008', '2012-08-02', 'Female', 'Student'),
('10112009', '10112009', '123456', N'Phan Như Quỳnh', '0910112009', '2012-09-17', 'Female', 'Student'),
('10112010', '10112010', '123456', N'Đỗ Thu Thảo', '0910112010', '2012-10-21', 'Female', 'Student'),
('10112011', '10112011', '123456', N'Nguyễn Thu Trang', '0910112011', '2012-11-05', 'Female', 'Student'),
('10112012', '10112012', '123456', N'Lê Ngọc Hân', '0910112012', '2012-12-19', 'Female', 'Student'),
('10112013', '10112013', '123456', N'Trần Mai Phương', '0910112013', '2012-01-25', 'Female', 'Student'),
('10112014', '10112014', '123456', N'Phạm Thanh Huyền', '0910112014', '2012-02-21', 'Female', 'Student'),
('10112015', '10112015', '123456', N'Vũ Minh Thư', '0910112015', '2012-03-12', 'Female', 'Student'),
('10112016', '10112016', '123456', N'Đặng Thu Hà', '0910112016', '2012-04-30', 'Female', 'Student'),
('10112017', '10112017', '123456', N'Hoàng Ngọc Ánh', '0910112017', '2012-05-22', 'Female', 'Student'),
('10112018', '10112018', '123456', N'Phan Thanh Tâm', '0910112018', '2012-06-14', 'Female', 'Student'),
('10112019', '10112019', '123456', N'Đỗ Bích Hạnh', '0910112019', '2012-07-06', 'Female', 'Student'),
('10112020', '10112020', '123456', N'Bùi Thu Hà', '0910112020', '2012-08-28', 'Female', 'Student'),
('10112021', '10112021', '123456', N'Nguyễn Minh Châu', '0910112021', '2012-09-10', 'Female', 'Student'),
('10112022', '10112022', '123456', N'Lê Thị Hồng', '0910112022', '2012-10-15', 'Female', 'Student'),
('10112023', '10112023', '123456', N'Trần Ngọc Diệp', '0910112023', '2012-11-30', 'Female', 'Student'),
('10112024', '10112024', '123456', N'Phạm Thu Thủy', '0910112024', '2012-12-06', 'Female', 'Student'),
('10112025', '10112025', '123456', N'Vũ Kim Ngân', '0910112025', '2012-01-20', 'Female', 'Student'),
('10112026', '10112026', '123456', N'Đặng Bích Ngọc', '0910112026', '2012-02-12', 'Female', 'Student'),
('10112027', '10112027', '123456', N'Hoàng Thu Thảo', '0910112027', '2012-04-01', 'Female', 'Student'),
('10112028', '10112028', '123456', N'Phan Mỹ Linh', '0910112028', '2012-04-16', 'Female', 'Student'),
('10112029', '10112029', '123456', N'Đỗ Mai Anh', '0910112029', '2012-05-29', 'Female', 'Student'),
('10112030', '10112030', '123456', N'Bùi Ngọc Trâm', '0910112030', '2012-06-11', 'Female', 'Student'),
('10112031', '10112031', '123456', N'Nguyễn Thu Hương', '0910112031', '2012-07-24', 'Female', 'Student'),
('10112032', '10112032', '123456', N'Lê Minh Anh', '0910112032', '2012-08-16', 'Female', 'Student'),
('10112033', '10112033', '123456', N'Trần Thanh Nhàn', '0910112033', '2012-10-02', 'Female', 'Student'),
('10112034', '10112034', '123456', N'Phạm Thu Nga', '0910112034', '2012-10-08', 'Female', 'Student'),
('10112035', '10112035', '123456', N'Vũ Ngọc Hà', '0910112035', '2012-11-19', 'Female', 'Student'),
('10112036', '10112036', '123456', N'Đặng Thị Lan', '0910112036', '2012-12-25', 'Female', 'Student'),
('10112037', '10112037', '123456', N'Hoàng Thanh Tâm', '0910112037', '2012-01-14', 'Female', 'Student'),
('10112038', '10112038', '123456', N'Phan Kim Anh', '0910112038', '2012-02-27', 'Female', 'Student'),
('10112039', '10112039', '123456', N'Đỗ Thu Trang', '0910112039', '2012-03-21', 'Female', 'Student'),
('10112040', '10112040', '123456', N'Bùi Minh Hằng', '0910112040', '2012-04-09', 'Female', 'Student'),
('10112041', '10112041', '123456', N'Nguyễn Thanh Thủy', '0910112041', '2012-05-18', 'Female', 'Student'),
('10112042', '10112042', '123456', N'Lê Thu Phương', '0910112042', '2012-06-30', 'Female', 'Student'),
('10112043', '10112043', '123456', N'Trần Ngọc Huyền', '0910112043', '2012-07-12', 'Female', 'Student'),
('10112044', '10112044', '123456', N'Phạm Thu Anh', '0910112044', '2012-08-23', 'Female', 'Student'),
('10112045', '10112045', '123456', N'Vũ Thanh Hằng', '0910112045', '2012-09-14', 'Female', 'Student'),
('10112046', '10112046', '123456', N'Đặng Minh Châu', '0910112046', '2012-11-01', 'Female', 'Student'),
('10112047', '10112047', '123456', N'Hoàng Thu Hà', '0910112047', '2012-11-10', 'Female', 'Student'),
('10112048', '10112048', '123456', N'Phan Bích Ngân', '0910112048', '2012-12-21', 'Female', 'Student'),
('10112049', '10112049', '123456', N'Đỗ Ngọc Mai', '0910112049', '2012-01-30', 'Female', 'Student'),
('10112050', '10112050', '123456', N'Bùi Thu Thảo', '0910112050', '2012-02-08', 'Female', 'Student'),

-- Khóa 2013
('10113001', '10113001', '123456', N'Nguyễn Lan Anh', '0910113001', '2013-01-14', 'Female', 'Student'),
('10113002', '10113002', '123456', N'Lê Hòa Bình', '0910113002', '2013-02-19', 'Female', 'Student'),
('10113003', '10113003', '123456', N'Trần Quỳnh Châu', '0910113003', '2013-03-24', 'Female', 'Student'),
('10113004', '10113004', '123456', N'Phạm Phương Dung', '0910113004', '2013-04-09', 'Female', 'Student'),
('10113005', '10113005', '123456', N'Vũ Mai Hoa', '0910113005', '2013-05-16', 'Female', 'Student'),
('10113006', '10113006', '123456', N'Đặng Kiều Ngọc', '0910113006', '2013-06-29', 'Female', 'Student'),
('10113007', '10113007', '123456', N'Hồ Mỹ Nhi', '0910113007', '2013-07-12', 'Female', 'Student'),
('10113008', '10113008', '123456', N'Hoàng Cẩm Oanh', '0910113008', '2013-08-03', 'Female', 'Student'),
('10113009', '10113009', '123456', N'Phan Xuân Quỳnh', '0910113009', '2013-09-18', 'Female', 'Student'),
('10113010', '10113010', '123456', N'Đỗ Hương Thảo', '0910113010', '2013-10-22', 'Female', 'Student'),
('10113011', '10113011', '123456', N'Nguyễn Thu Trang', '0910113011', '2013-11-06', 'Female', 'Student'),
('10113012', '10113012', '123456', N'Lê Ngọc Hân', '0910113012', '2013-12-20', 'Female', 'Student'),
('10113013', '10113013', '123456', N'Trần Mai Phương', '0910113013', '2013-01-26', 'Female', 'Student'),
('10113014', '10113014', '123456', N'Phạm Thanh Huyền', '0910113014', '2013-02-22', 'Female', 'Student'),
('10113015', '10113015', '123456', N'Vũ Minh Thư', '0910113015', '2013-03-13', 'Female', 'Student'),
('10113016', '10113016', '123456', N'Đặng Thu Hà', '0910113016', '2013-05-01', 'Female', 'Student'),
('10113017', '10113017', '123456', N'Hoàng Ngọc Ánh', '0910113017', '2013-05-23', 'Female', 'Student'),
('10113018', '10113018', '123456', N'Phan Thanh Tâm', '0910113018', '2013-06-15', 'Female', 'Student'),
('10113019', '10113019', '123456', N'Đỗ Bích Hạnh', '0910113019', '2013-07-07', 'Female', 'Student'),
('10113020', '10113020', '123456', N'Bùi Thu Hà', '0910113020', '2013-08-29', 'Female', 'Student'),
('10113021', '10113021', '123456', N'Nguyễn Minh Châu', '0910113021', '2013-09-11', 'Female', 'Student'),
('10113022', '10113022', '123456', N'Lê Thị Hồng', '0910113022', '2013-10-16', 'Female', 'Student'),
('10113023', '10113023', '123456', N'Trần Ngọc Diệp', '0910113023', '2013-12-01', 'Female', 'Student'),
('10113024', '10113024', '123456', N'Phạm Thu Thủy', '0910113024', '2013-12-07', 'Female', 'Student'),
('10113025', '10113025', '123456', N'Vũ Kim Ngân', '0910113025', '2013-01-21', 'Female', 'Student'),
('10113026', '10113026', '123456', N'Đặng Bích Ngọc', '0910113026', '2013-02-13', 'Female', 'Student'),
('10113027', '10113027', '123456', N'Hoàng Thu Thảo', '0910113027', '2013-04-02', 'Female', 'Student'),
('10113028', '10113028', '123456', N'Phan Mỹ Linh', '0910113028', '2013-04-17', 'Female', 'Student'),
('10113029', '10113029', '123456', N'Đỗ Mai Anh', '0910113029', '2013-05-30', 'Female', 'Student'),
('10113030', '10113030', '123456', N'Bùi Ngọc Trâm', '0910113030', '2013-06-12', 'Female', 'Student'),
('10113031', '10113031', '123456', N'Nguyễn Thu Hương', '0910113031', '2013-07-25', 'Female', 'Student'),
('10113032', '10113032', '123456', N'Lê Minh Anh', '0910113032', '2013-08-17', 'Female', 'Student'),
('10113033', '10113033', '123456', N'Trần Thanh Nhàn', '0910113033', '2013-10-03', 'Female', 'Student'),
('10113034', '10113034', '123456', N'Phạm Thu Nga', '0910113034', '2013-10-09', 'Female', 'Student'),
('10113035', '10113035', '123456', N'Vũ Ngọc Hà', '0910113035', '2013-11-20', 'Female', 'Student'),
('10113036', '10113036', '123456', N'Đặng Thị Lan', '0910113036', '2013-12-26', 'Female', 'Student'),
('10113037', '10113037', '123456', N'Hoàng Thanh Tâm', '0910113037', '2013-01-15', 'Female', 'Student'),
('10113038', '10113038', '123456', N'Phan Kim Anh', '0910113038', '2013-02-28', 'Female', 'Student'),
('10113039', '10113039', '123456', N'Đỗ Thu Trang', '0910113039', '2013-03-22', 'Female', 'Student'),
('10113040', '10113040', '123456', N'Bùi Minh Hằng', '0910113040', '2013-04-10', 'Female', 'Student'),
('10113041', '10113041', '123456', N'Nguyễn Thanh Thủy', '0910113041', '2013-05-19', 'Female', 'Student'),
('10113042', '10113042', '123456', N'Lê Thu Phương', '0910113042', '2013-07-01', 'Female', 'Student'),
('10113043', '10113043', '123456', N'Trần Ngọc Huyền', '0910113043', '2013-07-13', 'Female', 'Student'),
('10113044', '10113044', '123456', N'Phạm Thu Anh', '0910113044', '2013-08-24', 'Female', 'Student'),
('10113045', '10113045', '123456', N'Vũ Thanh Hằng', '0910113045', '2013-09-15', 'Female', 'Student'),
('10113046', '10113046', '123456', N'Đặng Minh Châu', '0910113046', '2013-11-02', 'Female', 'Student'),
('10113047', '10113047', '123456', N'Hoàng Thu Hà', '0910113047', '2013-11-11', 'Female', 'Student'),
('10113048', '10113048', '123456', N'Phan Bích Ngân', '0910113048', '2013-12-22', 'Female', 'Student'),
('10113049', '10113049', '123456', N'Đỗ Ngọc Mai', '0910113049', '2013-01-31', 'Female', 'Student'),
('10113050', '10113050', '123456', N'Bùi Thu Thảo', '0910113050', '2013-02-09', 'Female', 'Student'),



-- ================= NAM (MÃ 102) =================
-- Khóa 2009
('10209001', '10209001', '123456', N'Nguyễn Văn An', '0910209001', '2009-01-15', 'Male', 'Student'),
('10209002', '10209002', '123456', N'Lê Quốc Bảo', '0910209002', '2009-02-20', 'Male', 'Student'),
('10209003', '10209003', '123456', N'Trần Đình Chiến', '0910209003', '2009-03-25', 'Male', 'Student'),
('10209004', '10209004', '123456', N'Phạm Khắc Cường', '0910209004', '2009-04-10', 'Male', 'Student'),
('10209005', '10209005', '123456', N'Vũ Hải Đăng', '0910209005', '2009-05-17', 'Male', 'Student'),
('10209006', '10209006', '123456', N'Đặng Minh Hoàng', '0910209006', '2009-06-30', 'Male', 'Student'),
('10209007', '10209007', '123456', N'Hồ Trọng Hùng', '0910209007', '2009-07-13', 'Male', 'Student'),
('10209008', '10209008', '123456', N'Hoàng Tuấn Kiệt', '0910209008', '2009-08-04', 'Male', 'Student'),
('10209009', '10209009', '123456', N'Phan Thanh Long', '0910209009', '2009-09-19', 'Male', 'Student'),
('10209010', '10209010', '123456', N'Đỗ Quang Minh', '0910209010', '2009-10-23', 'Male', 'Student'),
('10209011', '10209011', '123456', N'Nguyễn Minh Đức', '0910209011', '2009-11-05', 'Male', 'Student'),
('10209012', '10209012', '123456', N'Lê Anh Tuấn', '0910209012', '2009-12-18', 'Male', 'Student'),
('10209013', '10209013', '123456', N'Trần Quốc Huy', '0910209013', '2009-01-26', 'Male', 'Student'),
('10209014', '10209014', '123456', N'Phạm Thành Công', '0910209014', '2009-02-22', 'Male', 'Student'),
('10209015', '10209015', '123456', N'Vũ Đức Thắng', '0910209015', '2009-03-14', 'Male', 'Student'),
('10209016', '10209016', '123456', N'Đặng Văn Hòa', '0910209016', '2009-04-30', 'Male', 'Student'),
('10209017', '10209017', '123456', N'Hoàng Ngọc Sơn', '0910209017', '2009-05-21', 'Male', 'Student'),
('10209018', '10209018', '123456', N'Phan Anh Dũng', '0910209018', '2009-06-12', 'Male', 'Student'),
('10209019', '10209019', '123456', N'Đỗ Thành Nam', '0910209019', '2009-07-06', 'Male', 'Student'),
('10209020', '10209020', '123456', N'Bùi Quang Huy', '0910209020', '2009-08-27', 'Male', 'Student'),
('10209021', '10209021', '123456', N'Nguyễn Văn Tùng', '0910209021', '2009-09-08', 'Male', 'Student'),
('10209022', '10209022', '123456', N'Lê Đức Anh', '0910209022', '2009-10-13', 'Male', 'Student'),
('10209023', '10209023', '123456', N'Trần Minh Quân', '0910209023', '2009-11-29', 'Male', 'Student'),
('10209024', '10209024', '123456', N'Phạm Quốc Trung', '0910209024', '2009-12-04', 'Male', 'Student'),
('10209025', '10209025', '123456', N'Vũ Hồng Phúc', '0910209025', '2009-01-19', 'Male', 'Student'),
('10209026', '10209026', '123456', N'Đặng Công Thành', '0910209026', '2009-02-11', 'Male', 'Student'),
('10209027', '10209027', '123456', N'Hoàng Văn Phong', '0910209027', '2009-04-01', 'Male', 'Student'),
('10209028', '10209028', '123456', N'Phan Đức Lâm', '0910209028', '2009-04-16', 'Male', 'Student'),
('10209029', '10209029', '123456', N'Đỗ Ngọc Khánh', '0910209029', '2009-05-28', 'Male', 'Student'),
('10209030', '10209030', '123456', N'Bùi Văn Trường', '0910209030', '2009-06-10', 'Male', 'Student'),
('10209031', '10209031', '123456', N'Nguyễn Thanh Bình', '0910209031', '2009-07-23', 'Male', 'Student'),
('10209032', '10209032', '123456', N'Lê Minh Trí', '0910209032', '2009-08-15', 'Male', 'Student'),
('10209033', '10209033', '123456', N'Trần Quốc Việt', '0910209033', '2009-10-01', 'Male', 'Student'),
('10209034', '10209034', '123456', N'Phạm Anh Tuấn', '0910209034', '2009-10-07', 'Male', 'Student'),
('10209035', '10209035', '123456', N'Vũ Ngọc Hải', '0910209035', '2009-11-18', 'Male', 'Student'),
('10209036', '10209036', '123456', N'Đặng Văn Nam', '0910209036', '2009-12-24', 'Male', 'Student'),
('10209037', '10209037', '123456', N'Hoàng Đức Duy', '0910209037', '2009-01-13', 'Male', 'Student'),
('10209038', '10209038', '123456', N'Phan Minh Hiếu', '0910209038', '2009-02-26', 'Male', 'Student'),
('10209039', '10209039', '123456', N'Đỗ Quốc Bảo', '0910209039', '2009-03-20', 'Male', 'Student'),
('10209040', '10209040', '123456', N'Bùi Thanh Sơn', '0910209040', '2009-04-08', 'Male', 'Student'),
('10209041', '10209041', '123456', N'Nguyễn Công Hoàng', '0910209041', '2009-05-17', 'Male', 'Student'),
('10209042', '10209042', '123456', N'Lê Văn Cường', '0910209042', '2009-06-29', 'Male', 'Student'),
('10209043', '10209043', '123456', N'Trần Ngọc Dũng', '0910209043', '2009-07-11', 'Male', 'Student'),
('10209044', '10209044', '123456', N'Phạm Đức Long', '0910209044', '2009-08-22', 'Male', 'Student'),
('10209045', '10209045', '123456', N'Vũ Thanh Phong', '0910209045', '2009-09-13', 'Male', 'Student'),
('10209046', '10209046', '123456', N'Đặng Minh Tuấn', '0910209046', '2009-11-01', 'Male', 'Student'),
('10209047', '10209047', '123456', N'Hoàng Văn Hùng', '0910209047', '2009-11-10', 'Male', 'Student'),
('10209048', '10209048', '123456', N'Phan Đức Anh', '0910209048', '2009-12-21', 'Male', 'Student'),
('10209049', '10209049', '123456', N'Đỗ Ngọc Sơn', '0910209049', '2009-01-30', 'Male', 'Student'),
('10209050', '10209050', '123456', N'Bùi Văn Nam', '0910209050', '2009-02-08', 'Male', 'Student'),

-- Khóa 2010
('10210001', '10210001', '123456', N'Nguyễn Bình An', '0910210001', '2010-01-16', 'Male', 'Student'),
('10210002', '10210002', '123456', N'Lê Gia Bảo', '0910210002', '2010-02-21', 'Male', 'Student'),
('10210003', '10210003', '123456', N'Trần Quý Chiến', '0910210003', '2010-03-26', 'Male', 'Student'),
('10210004', '10210004', '123456', N'Phạm Hùng Cường', '0910210004', '2010-04-11', 'Male', 'Student'),
('10210005', '10210005', '123456', N'Vũ Minh Đăng', '0910210005', '2010-05-18', 'Male', 'Student'),
('10210006', '10210006', '123456', N'Đặng Việt Hoàng', '0910210006', '2010-07-01', 'Male', 'Student'),
('10210007', '10210007', '123456', N'Hồ Việt Hùng', '0910210007', '2010-07-14', 'Male', 'Student'),
('10210008', '10210008', '123456', N'Hoàng Anh Kiệt', '0910210008', '2010-08-05', 'Male', 'Student'),
('10210009', '10210009', '123456', N'Phan Hải Long', '0910210009', '2010-09-20', 'Male', 'Student'),
('10210010', '10210010', '123456', N'Đỗ Nhật Minh', '0910210010', '2010-10-24', 'Male', 'Student'),
('10210011', '10210011', '123456', N'Nguyễn Minh Đức', '0910210011', '2010-11-06', 'Male', 'Student'),
('10210012', '10210012', '123456', N'Lê Anh Tuấn', '0910210012', '2010-12-19', 'Male', 'Student'),
('10210013', '10210013', '123456', N'Trần Quốc Huy', '0910210013', '2010-01-27', 'Male', 'Student'),
('10210014', '10210014', '123456', N'Phạm Thành Công', '0910210014', '2010-02-23', 'Male', 'Student'),
('10210015', '10210015', '123456', N'Vũ Đức Thắng', '0910210015', '2010-03-15', 'Male', 'Student'),
('10210016', '10210016', '123456', N'Đặng Văn Hòa', '0910210016', '2010-05-01', 'Male', 'Student'),
('10210017', '10210017', '123456', N'Hoàng Ngọc Sơn', '0910210017', '2010-05-22', 'Male', 'Student'),
('10210018', '10210018', '123456', N'Phan Anh Dũng', '0910210018', '2010-06-13', 'Male', 'Student'),
('10210019', '10210019', '123456', N'Đỗ Thành Nam', '0910210019', '2010-07-07', 'Male', 'Student'),
('10210020', '10210020', '123456', N'Bùi Quang Huy', '0910210020', '2010-08-28', 'Male', 'Student'),
('10210021', '10210021', '123456', N'Nguyễn Văn Tùng', '0910210021', '2010-09-09', 'Male', 'Student'),
('10210022', '10210022', '123456', N'Lê Đức Anh', '0910210022', '2010-10-14', 'Male', 'Student'),
('10210023', '10210023', '123456', N'Trần Minh Quân', '0910210023', '2010-11-30', 'Male', 'Student'),
('10210024', '10210024', '123456', N'Phạm Quốc Trung', '0910210024', '2010-12-05', 'Male', 'Student'),
('10210025', '10210025', '123456', N'Vũ Hồng Phúc', '0910210025', '2010-01-20', 'Male', 'Student'),
('10210026', '10210026', '123456', N'Đặng Công Thành', '0910210026', '2010-02-12', 'Male', 'Student'),
('10210027', '10210027', '123456', N'Hoàng Văn Phong', '0910210027', '2010-04-02', 'Male', 'Student'),
('10210028', '10210028', '123456', N'Phan Đức Lâm', '0910210028', '2010-04-17', 'Male', 'Student'),
('10210029', '10210029', '123456', N'Đỗ Ngọc Khánh', '0910210029', '2010-05-29', 'Male', 'Student'),
('10210030', '10210030', '123456', N'Bùi Văn Trường', '0910210030', '2010-06-11', 'Male', 'Student'),
('10210031', '10210031', '123456', N'Nguyễn Thanh Bình', '0910210031', '2010-07-24', 'Male', 'Student'),
('10210032', '10210032', '123456', N'Lê Minh Trí', '0910210032', '2010-08-16', 'Male', 'Student'),
('10210033', '10210033', '123456', N'Trần Quốc Việt', '0910210033', '2010-10-02', 'Male', 'Student'),
('10210034', '10210034', '123456', N'Phạm Anh Tuấn', '0910210034', '2010-10-08', 'Male', 'Student'),
('10210035', '10210035', '123456', N'Vũ Ngọc Hải', '0910210035', '2010-11-19', 'Male', 'Student'),
('10210036', '10210036', '123456', N'Đặng Văn Nam', '0910210036', '2010-12-25', 'Male', 'Student'),
('10210037', '10210037', '123456', N'Hoàng Đức Duy', '0910210037', '2010-01-14', 'Male', 'Student'),
('10210038', '10210038', '123456', N'Phan Minh Hiếu', '0910210038', '2010-02-27', 'Male', 'Student'),
('10210039', '10210039', '123456', N'Đỗ Quốc Bảo', '0910210039', '2010-03-21', 'Male', 'Student'),
('10210040', '10210040', '123456', N'Bùi Thanh Sơn', '0910210040', '2010-04-09', 'Male', 'Student'),
('10210041', '10210041', '123456', N'Nguyễn Công Hoàng', '0910210041', '2010-05-18', 'Male', 'Student'),
('10210042', '10210042', '123456', N'Lê Văn Cường', '0910210042', '2010-06-30', 'Male', 'Student'),
('10210043', '10210043', '123456', N'Trần Ngọc Dũng', '0910210043', '2010-07-12', 'Male', 'Student'),
('10210044', '10210044', '123456', N'Phạm Đức Long', '0910210044', '2010-08-23', 'Male', 'Student'),
('10210045', '10210045', '123456', N'Vũ Thanh Phong', '0910210045', '2010-09-14', 'Male', 'Student'),
('10210046', '10210046', '123456', N'Đặng Minh Tuấn', '0910210046', '2010-11-02', 'Male', 'Student'),
('10210047', '10210047', '123456', N'Hoàng Văn Hùng', '0910210047', '2010-11-11', 'Male', 'Student'),
('10210048', '10210048', '123456', N'Phan Đức Anh', '0910210048', '2010-12-22', 'Male', 'Student'),
('10210049', '10210049', '123456', N'Đỗ Ngọc Sơn', '0910210049', '2010-01-31', 'Male', 'Student'),
('10210050', '10210050', '123456', N'Bùi Văn Nam', '0910210050', '2010-02-09', 'Male', 'Student'),

-- Khóa 2011
('10211001', '10211001', '123456', N'Nguyễn Hoàng An', '0910211001', '2011-01-17', 'Male', 'Student'),
('10211002', '10211002', '123456', N'Lê Chí Bảo', '0910211002', '2011-02-22', 'Male', 'Student'),
('10211003', '10211003', '123456', N'Trần Ngọc Chiến', '0910211003', '2011-03-27', 'Male', 'Student'),
('10211004', '10211004', '123456', N'Phạm Mạnh Cường', '0910211004', '2011-04-12', 'Male', 'Student'),
('10211005', '10211005', '123456', N'Vũ Tiến Đăng', '0910211005', '2011-05-19', 'Male', 'Student'),
('10211006', '10211006', '123456', N'Đặng Huy Hoàng', '0910211006', '2011-07-02', 'Male', 'Student'),
('10211007', '10211007', '123456', N'Hồ Quốc Hùng', '0910211007', '2011-07-15', 'Male', 'Student'),
('10211008', '10211008', '123456', N'Hoàng Tuấn Kiệt', '0910211008', '2011-08-06', 'Male', 'Student'),
('10211009', '10211009', '123456', N'Phan Hoàng Long', '0910211009', '2011-09-21', 'Male', 'Student'),
('10211010', '10211010', '123456', N'Đỗ Tuấn Minh', '0910211010', '2011-10-25', 'Male', 'Student'),
('10211011', '10211011', '123456', N'Nguyễn Minh Đức', '0910211011', '2011-11-07', 'Male', 'Student'),
('10211012', '10211012', '123456', N'Lê Anh Tuấn', '0910211012', '2011-12-20', 'Male', 'Student'),
('10211013', '10211013', '123456', N'Trần Quốc Huy', '0910211013', '2011-01-28', 'Male', 'Student'),
('10211014', '10211014', '123456', N'Phạm Thành Công', '0910211014', '2011-02-24', 'Male', 'Student'),
('10211015', '10211015', '123456', N'Vũ Đức Thắng', '0910211015', '2011-03-16', 'Male', 'Student'),
('10211016', '10211016', '123456', N'Đặng Văn Hòa', '0910211016', '2011-05-02', 'Male', 'Student'),
('10211017', '10211017', '123456', N'Hoàng Ngọc Sơn', '0910211017', '2011-05-23', 'Male', 'Student'),
('10211018', '10211018', '123456', N'Phan Anh Dũng', '0910211018', '2011-06-14', 'Male', 'Student'),
('10211019', '10211019', '123456', N'Đỗ Thành Nam', '0910211019', '2011-07-08', 'Male', 'Student'),
('10211020', '10211020', '123456', N'Bùi Quang Huy', '0910211020', '2011-08-29', 'Male', 'Student'),
('10211021', '10211021', '123456', N'Nguyễn Văn Tùng', '0910211021', '2011-09-10', 'Male', 'Student'),
('10211022', '10211022', '123456', N'Lê Đức Anh', '0910211022', '2011-10-15', 'Male', 'Student'),
('10211023', '10211023', '123456', N'Trần Minh Quân', '0910211023', '2011-12-01', 'Male', 'Student'),
('10211024', '10211024', '123456', N'Phạm Quốc Trung', '0910211024', '2011-12-06', 'Male', 'Student'),
('10211025', '10211025', '123456', N'Vũ Hồng Phúc', '0910211025', '2011-01-21', 'Male', 'Student'),
('10211026', '10211026', '123456', N'Đặng Công Thành', '0910211026', '2011-02-13', 'Male', 'Student'),
('10211027', '10211027', '123456', N'Hoàng Văn Phong', '0910211027', '2011-04-03', 'Male', 'Student'),
('10211028', '10211028', '123456', N'Phan Đức Lâm', '0910211028', '2011-04-18', 'Male', 'Student'),
('10211029', '10211029', '123456', N'Đỗ Ngọc Khánh', '0910211029', '2011-05-30', 'Male', 'Student'),
('10211030', '10211030', '123456', N'Bùi Văn Trường', '0910211030', '2011-06-12', 'Male', 'Student'),
('10211031', '10211031', '123456', N'Nguyễn Thanh Bình', '0910211031', '2011-07-25', 'Male', 'Student'),
('10211032', '10211032', '123456', N'Lê Minh Trí', '0910211032', '2011-08-17', 'Male', 'Student'),
('10211033', '10211033', '123456', N'Trần Quốc Việt', '0910211033', '2011-10-03', 'Male', 'Student'),
('10211034', '10211034', '123456', N'Phạm Anh Tuấn', '0910211034', '2011-10-09', 'Male', 'Student'),
('10211035', '10211035', '123456', N'Vũ Ngọc Hải', '0910211035', '2011-11-20', 'Male', 'Student'),
('10211036', '10211036', '123456', N'Đặng Văn Nam', '0910211036', '2011-12-26', 'Male', 'Student'),
('10211037', '10211037', '123456', N'Hoàng Đức Duy', '0910211037', '2011-01-15', 'Male', 'Student'),
('10211038', '10211038', '123456', N'Phan Minh Hiếu', '0910211038', '2011-02-28', 'Male', 'Student'),
('10211039', '10211039', '123456', N'Đỗ Quốc Bảo', '0910211039', '2011-03-22', 'Male', 'Student'),
('10211040', '10211040', '123456', N'Bùi Thanh Sơn', '0910211040', '2011-04-10', 'Male', 'Student'),
('10211041', '10211041', '123456', N'Nguyễn Công Hoàng', '0910211041', '2011-05-19', 'Male', 'Student'),
('10211042', '10211042', '123456', N'Lê Văn Cường', '0910211042', '2011-07-01', 'Male', 'Student'),
('10211043', '10211043', '123456', N'Trần Ngọc Dũng', '0910211043', '2011-07-13', 'Male', 'Student'),
('10211044', '10211044', '123456', N'Phạm Đức Long', '0910211044', '2011-08-24', 'Male', 'Student'),
('10211045', '10211045', '123456', N'Vũ Thanh Phong', '0910211045', '2011-09-15', 'Male', 'Student'),
('10211046', '10211046', '123456', N'Đặng Minh Tuấn', '0910211046', '2011-11-02', 'Male', 'Student'),
('10211047', '10211047', '123456', N'Hoàng Văn Hùng', '0910211047', '2011-11-11', 'Male', 'Student'),
('10211048', '10211048', '123456', N'Phan Đức Anh', '0910211048', '2011-12-22', 'Male', 'Student'),
('10211049', '10211049', '123456', N'Đỗ Ngọc Sơn', '0910211049', '2011-01-31', 'Male', 'Student'),
('10211050', '10211050', '123456', N'Bùi Văn Nam', '0910211050', '2011-02-09', 'Male', 'Student'),

-- Khóa 2012
('10212001', '10212001', '123456', N'Nguyễn Thiên An', '0910212001', '2012-01-18', 'Male', 'Student'),
('10212002', '10212002', '123456', N'Lê Đức Bảo', '0910212002', '2012-02-23', 'Male', 'Student'),
('10212003', '10212003', '123456', N'Trần Đức Chiến', '0910212003', '2012-03-28', 'Male', 'Student'),
('10212004', '10212004', '123456', N'Phạm Quốc Cường', '0910212004', '2012-04-13', 'Male', 'Student'),
('10212005', '10212005', '123456', N'Vũ Đăng Khoa', '0910212005', '2012-05-20', 'Male', 'Student'),
('10212006', '10212006', '123456', N'Đặng Bảo Hoàng', '0910212006', '2012-07-03', 'Male', 'Student'),
('10212007', '10212007', '123456', N'Hồ Tuấn Hùng', '0910212007', '2012-07-16', 'Male', 'Student'),
('10212008', '10212008', '123456', N'Hoàng Minh Kiệt', '0910212008', '2012-08-07', 'Male', 'Student'),
('10212009', '10212009', '123456', N'Phan Tiến Long', '0910212009', '2012-09-22', 'Male', 'Student'),
('10212010', '10212010', '123456', N'Đỗ Bình Minh', '0910212010', '2012-10-26', 'Male', 'Student'),
('10212011', '10212011', '123456', N'Nguyễn Minh Đức', '0910212011', '2012-11-08', 'Male', 'Student'),
('10212012', '10212012', '123456', N'Lê Anh Tuấn', '0910212012', '2012-12-21', 'Male', 'Student'),
('10212013', '10212013', '123456', N'Trần Quốc Huy', '0910212013', '2012-01-29', 'Male', 'Student'),
('10212014', '10212014', '123456', N'Phạm Thành Công', '0910212014', '2012-02-25', 'Male', 'Student'),
('10212015', '10212015', '123456', N'Vũ Đức Thắng', '0910212015', '2012-03-17', 'Male', 'Student'),
('10212016', '10212016', '123456', N'Đặng Văn Hòa', '0910212016', '2012-05-03', 'Male', 'Student'),
('10212017', '10212017', '123456', N'Hoàng Ngọc Sơn', '0910212017', '2012-05-24', 'Male', 'Student'),
('10212018', '10212018', '123456', N'Phan Anh Dũng', '0910212018', '2012-06-15', 'Male', 'Student'),
('10212019', '10212019', '123456', N'Đỗ Thành Nam', '0910212019', '2012-07-09', 'Male', 'Student'),
('10212020', '10212020', '123456', N'Bùi Quang Huy', '0910212020', '2012-08-30', 'Male', 'Student'),
('10212021', '10212021', '123456', N'Nguyễn Văn Tùng', '0910212021', '2012-09-11', 'Male', 'Student'),
('10212022', '10212022', '123456', N'Lê Đức Anh', '0910212022', '2012-10-16', 'Male', 'Student'),
('10212023', '10212023', '123456', N'Trần Minh Quân', '0910212023', '2012-12-02', 'Male', 'Student'),
('10212024', '10212024', '123456', N'Phạm Quốc Trung', '0910212024', '2012-12-07', 'Male', 'Student'),
('10212025', '10212025', '123456', N'Vũ Hồng Phúc', '0910212025', '2012-01-22', 'Male', 'Student'),
('10212026', '10212026', '123456', N'Đặng Công Thành', '0910212026', '2012-02-14', 'Male', 'Student'),
('10212027', '10212027', '123456', N'Hoàng Văn Phong', '0910212027', '2012-04-03', 'Male', 'Student'),
('10212028', '10212028', '123456', N'Phan Đức Lâm', '0910212028', '2012-04-18', 'Male', 'Student'),
('10212029', '10212029', '123456', N'Đỗ Ngọc Khánh', '0910212029', '2012-05-30', 'Male', 'Student'),
('10212030', '10212030', '123456', N'Bùi Văn Trường', '0910212030', '2012-06-12', 'Male', 'Student'),
('10212031', '10212031', '123456', N'Nguyễn Thanh Bình', '0910212031', '2012-07-25', 'Male', 'Student'),
('10212032', '10212032', '123456', N'Lê Minh Trí', '0910212032', '2012-08-17', 'Male', 'Student'),
('10212033', '10212033', '123456', N'Trần Quốc Việt', '0910212033', '2012-10-03', 'Male', 'Student'),
('10212034', '10212034', '123456', N'Phạm Anh Tuấn', '0910212034', '2012-10-09', 'Male', 'Student'),
('10212035', '10212035', '123456', N'Vũ Ngọc Hải', '0910212035', '2012-11-20', 'Male', 'Student'),
('10212036', '10212036', '123456', N'Đặng Văn Nam', '0910212036', '2012-12-26', 'Male', 'Student'),
('10212037', '10212037', '123456', N'Hoàng Đức Duy', '0910212037', '2012-01-15', 'Male', 'Student'),
('10212038', '10212038', '123456', N'Phan Minh Hiếu', '0910212038', '2012-02-28', 'Male', 'Student'),
('10212039', '10212039', '123456', N'Đỗ Quốc Bảo', '0910212039', '2012-03-22', 'Male', 'Student'),
('10212040', '10212040', '123456', N'Bùi Thanh Sơn', '0910212040', '2012-04-10', 'Male', 'Student'),
('10212041', '10212041', '123456', N'Nguyễn Công Hoàng', '0910212041', '2012-05-19', 'Male', 'Student'),
('10212042', '10212042', '123456', N'Lê Văn Cường', '0910212042', '2012-07-01', 'Male', 'Student'),
('10212043', '10212043', '123456', N'Trần Ngọc Dũng', '0910212043', '2012-07-13', 'Male', 'Student'),
('10212044', '10212044', '123456', N'Phạm Đức Long', '0910212044', '2012-08-24', 'Male', 'Student'),
('10212045', '10212045', '123456', N'Vũ Thanh Phong', '0910212045', '2012-09-15', 'Male', 'Student'),
('10212046', '10212046', '123456', N'Đặng Minh Tuấn', '0910212046', '2012-11-02', 'Male', 'Student'),
('10212047', '10212047', '123456', N'Hoàng Văn Hùng', '0910212047', '2012-11-11', 'Male', 'Student'),
('10212048', '10212048', '123456', N'Phan Đức Anh', '0910212048', '2012-12-22', 'Male', 'Student'),
('10212049', '10212049', '123456', N'Đỗ Ngọc Sơn', '0910212049', '2012-01-31', 'Male', 'Student'),
('10212050', '10212050', '123456', N'Bùi Văn Nam', '0910212050', '2012-02-09', 'Male', 'Student'),

-- Khóa 2013
('10213001', '10213001', '123456', N'Nguyễn Trường An', '0910213001', '2013-01-19', 'Male', 'Student'),
('10213002', '10213002', '123456', N'Lê Tuấn Bảo', '0910213002', '2013-02-24', 'Male', 'Student'),
('10213003', '10213003', '123456', N'Trần Hữu Chiến', '0910213003', '2013-03-29', 'Male', 'Student'),
('10213004', '10213004', '123456', N'Phạm Tiến Cường', '0910213004', '2013-04-14', 'Male', 'Student'),
('10213005', '10213005', '123456', N'Vũ Tuấn Đăng', '0910213005', '2013-05-21', 'Male', 'Student'),
('10213006', '10213006', '123456', N'Đặng Tuấn Hoàng', '0910213006', '2013-07-04', 'Male', 'Student'),
('10213007', '10213007', '123456', N'Hồ Mạnh Hùng', '0910213007', '2013-07-17', 'Male', 'Student'),
('10213008', '10213008', '123456', N'Hoàng Quốc Kiệt', '0910213008', '2013-08-08', 'Male', 'Student'),
('10213009', '10213009', '123456', N'Phan Đức Long', '0910213009', '2013-09-23', 'Male', 'Student'),
('10213010', '10213010', '123456', N'Đỗ Hải Minh', '0910213010', '2013-10-27', 'Male', 'Student'),
('10213011', '10213011', '123456', N'Nguyễn Minh Đức', '0910213011', '2013-11-09', 'Male', 'Student'),
('10213012', '10213012', '123456', N'Lê Anh Tuấn', '0910213012', '2013-12-22', 'Male', 'Student'),
('10213013', '10213013', '123456', N'Trần Quốc Huy', '0910213013', '2013-01-30', 'Male', 'Student'),
('10213014', '10213014', '123456', N'Phạm Thành Công', '0910213014', '2013-02-26', 'Male', 'Student'),
('10213015', '10213015', '123456', N'Vũ Đức Thắng', '0910213015', '2013-03-18', 'Male', 'Student'),
('10213016', '10213016', '123456', N'Đặng Văn Hòa', '0910213016', '2013-05-04', 'Male', 'Student'),
('10213017', '10213017', '123456', N'Hoàng Ngọc Sơn', '0910213017', '2013-05-25', 'Male', 'Student'),
('10213018', '10213018', '123456', N'Phan Anh Dũng', '0910213018', '2013-06-16', 'Male', 'Student'),
('10213019', '10213019', '123456', N'Đỗ Thành Nam', '0910213019', '2013-07-10', 'Male', 'Student'),
('10213020', '10213020', '123456', N'Bùi Quang Huy', '0910213020', '2013-08-31', 'Male', 'Student'),
('10213021', '10213021', '123456', N'Nguyễn Văn Tùng', '0910213021', '2013-09-12', 'Male', 'Student'),
('10213022', '10213022', '123456', N'Lê Đức Anh', '0910213022', '2013-10-17', 'Male', 'Student'),
('10213023', '10213023', '123456', N'Trần Minh Quân', '0910213023', '2013-12-03', 'Male', 'Student'),
('10213024', '10213024', '123456', N'Phạm Quốc Trung', '0910213024', '2013-12-08', 'Male', 'Student'),
('10213025', '10213025', '123456', N'Vũ Hồng Phúc', '0910213025', '2013-01-23', 'Male', 'Student'),
('10213026', '10213026', '123456', N'Đặng Công Thành', '0910213026', '2013-02-15', 'Male', 'Student'),
('10213027', '10213027', '123456', N'Hoàng Văn Phong', '0910213027', '2013-04-04', 'Male', 'Student'),
('10213028', '10213028', '123456', N'Phan Đức Lâm', '0910213028', '2013-04-19', 'Male', 'Student'),
('10213029', '10213029', '123456', N'Đỗ Ngọc Khánh', '0910213029', '2013-05-31', 'Male', 'Student'),
('10213030', '10213030', '123456', N'Bùi Văn Trường', '0910213030', '2013-06-13', 'Male', 'Student'),
('10213031', '10213031', '123456', N'Nguyễn Thanh Bình', '0910213031', '2013-07-26', 'Male', 'Student'),
('10213032', '10213032', '123456', N'Lê Minh Trí', '0910213032', '2013-08-18', 'Male', 'Student'),
('10213033', '10213033', '123456', N'Trần Quốc Việt', '0910213033', '2013-10-04', 'Male', 'Student'),
('10213034', '10213034', '123456', N'Phạm Anh Tuấn', '0910213034', '2013-10-10', 'Male', 'Student'),
('10213035', '10213035', '123456', N'Vũ Ngọc Hải', '0910213035', '2013-11-21', 'Male', 'Student'),
('10213036', '10213036', '123456', N'Đặng Văn Nam', '0910213036', '2013-12-27', 'Male', 'Student'),
('10213037', '10213037', '123456', N'Hoàng Đức Duy', '0910213037', '2013-01-16', 'Male', 'Student'),
('10213038', '10213038', '123456', N'Phan Minh Hiếu', '0910213038', '2013-03-01', 'Male', 'Student'),
('10213039', '10213039', '123456', N'Đỗ Quốc Bảo', '0910213039', '2013-03-23', 'Male', 'Student'),
('10213040', '10213040', '123456', N'Bùi Thanh Sơn', '0910213040', '2013-04-11', 'Male', 'Student'),
('10213041', '10213041', '123456', N'Nguyễn Công Hoàng', '0910213041', '2013-05-20', 'Male', 'Student'),
('10213042', '10213042', '123456', N'Lê Văn Cường', '0910213042', '2013-07-02', 'Male', 'Student'),
('10213043', '10213043', '123456', N'Trần Ngọc Dũng', '0910213043', '2013-07-14', 'Male', 'Student'),
('10213044', '10213044', '123456', N'Phạm Đức Long', '0910213044', '2013-08-25', 'Male', 'Student'),
('10213045', '10213045', '123456', N'Vũ Thanh Phong', '0910213045', '2013-09-16', 'Male', 'Student'),
('10213046', '10213046', '123456', N'Đặng Minh Tuấn', '0910213046', '2013-11-03', 'Male', 'Student'),
('10213047', '10213047', '123456', N'Hoàng Văn Hùng', '0910213047', '2013-11-12', 'Male', 'Student'),
('10213048', '10213048', '123456', N'Phan Đức Anh', '0910213048', '2013-12-23', 'Male', 'Student'),
('10213049', '10213049', '123456', N'Đỗ Ngọc Sơn', '0910213049', '2013-02-01', 'Male', 'Student'),
('10213050', '10213050', '123456', N'Bùi Văn Nam', '0910213050', '2013-02-10', 'Male', 'Student');
GO





-- TeacherInfo
IF OBJECT_ID('teacherInfo', 'U') IS NOT NULL
    DROP TABLE teacherInfo;
GO
CREATE TABLE teacherInfo (
    Id NVARCHAR(20) PRIMARY KEY,
    subject NVARCHAR(100) NOT NULL,
    CONSTRAINT FK_teacherInfo_account
    FOREIGN KEY (Id) REFERENCES accountList(Id)
);
GO
INSERT INTO teacherInfo (Id, subject)
VALUES
-- ================= TOÁN =================
('T01', N'Toán'), ('T02', N'Toán'), ('T03', N'Toán'), ('T04', N'Toán'), ('T05', N'Toán'), ('T06', N'Toán'), ('T07', N'Toán'), ('T08', N'Toán'), ('T09', N'Toán'), ('T10', N'Toán'), 
('T11', N'Toán'), ('T12', N'Toán'), ('T13', N'Toán'), ('T14', N'Toán'), ('T15', N'Toán'), ('T16', N'Toán'), ('T17', N'Toán'), ('T18', N'Toán'), ('T19', N'Toán'), ('T20', N'Toán'),

-- ================= VĂN =================
('V01', N'Văn'), ('V02', N'Văn'), ('V03', N'Văn'), ('V04', N'Văn'), ('V05', N'Văn'), ('V06', N'Văn'), ('V07', N'Văn'), ('V08', N'Văn'), ('V09', N'Văn'), ('V10', N'Văn'), 
('V11', N'Văn'), ('V12', N'Văn'), ('V13', N'Văn'), ('V14', N'Văn'), ('V15', N'Văn'), ('V16', N'Văn'), ('V17', N'Văn'), ('V18', N'Văn'), ('V19', N'Văn'), ('V20', N'Văn'),

-- ================= HÓA =================
('H01', N'Hóa'), ('H02', N'Hóa'), ('H03', N'Hóa'), ('H04', N'Hóa'), ('H05', N'Hóa'), ('H06', N'Hóa'), ('H07', N'Hóa'), ('H08', N'Hóa'), ('H09', N'Hóa'), ('H10', N'Hóa'), 
('H11', N'Hóa'), ('H12', N'Hóa'), ('H13', N'Hóa'), ('H14', N'Hóa'), ('H15', N'Hóa'), ('H16', N'Hóa'), ('H17', N'Hóa'), ('H18', N'Hóa'), ('H19', N'Hóa'), ('H20', N'Hóa'),

-- ================= LÝ =================
('L01', N'Lý'), ('L02', N'Lý'), ('L03', N'Lý'), ('L04', N'Lý'), ('L05', N'Lý'), ('L06', N'Lý'), ('L07', N'Lý'), ('L08', N'Lý'), ('L09', N'Lý'), ('L10', N'Lý'), 
('L11', N'Lý'), ('L12', N'Lý'), ('L13', N'Lý'), ('L14', N'Lý'), ('L15', N'Lý'), ('L16', N'Lý'), ('L17', N'Lý'), ('L18', N'Lý'), ('L19', N'Lý'), ('L20', N'Lý'),

-- ================= SINH =================
('S01', N'Sinh'), ('S02', N'Sinh'), ('S03', N'Sinh'), ('S04', N'Sinh'), ('S05', N'Sinh'), ('S06', N'Sinh'), ('S07', N'Sinh'), ('S08', N'Sinh'), ('S09', N'Sinh'), ('S10', N'Sinh'), 
('S11', N'Sinh'), ('S12', N'Sinh'), ('S13', N'Sinh'), ('S14', N'Sinh'), ('S15', N'Sinh'), ('S16', N'Sinh'), ('S17', N'Sinh'), ('S18', N'Sinh'), ('S19', N'Sinh'), ('S20', N'Sinh'),

-- ================= TIẾNG ANH =================
('NNA01', N'Tiếng Anh'), ('NNA02', N'Tiếng Anh'), ('NNA03', N'Tiếng Anh'), ('NNA04', N'Tiếng Anh'), ('NNA05', N'Tiếng Anh'), ('NNA06', N'Tiếng Anh'), ('NNA07', N'Tiếng Anh'), ('NNA08', N'Tiếng Anh'), ('NNA09', N'Tiếng Anh'), 
('NNA10', N'Tiếng Anh'), ('NNA11', N'Tiếng Anh'), ('NNA12', N'Tiếng Anh'), ('NNA13', N'Tiếng Anh'), ('NNA14', N'Tiếng Anh'), ('NNA15', N'Tiếng Anh'), ('NNA16', N'Tiếng Anh'), ('NNA17', N'Tiếng Anh'), ('NNA18', N'Tiếng Anh'), ('NNA19', N'Tiếng Anh'), ('NNA20', N'Tiếng Anh'),

-- ================= TIẾNG NHẬT =================
('NNN01', N'Tiếng Nhật'), ('NNN02', N'Tiếng Nhật'), ('NNN03', N'Tiếng Nhật'), ('NNN04', N'Tiếng Nhật'), ('NNN05', N'Tiếng Nhật'), ('NNN06', N'Tiếng Nhật'), ('NNN07', N'Tiếng Nhật'), ('NNN08', N'Tiếng Nhật'), ('NNN09', N'Tiếng Nhật'), ('NNN10', N'Tiếng Nhật'), 
('NNN11', N'Tiếng Nhật'), ('NNN12', N'Tiếng Nhật'), ('NNN13', N'Tiếng Nhật'), ('NNN14', N'Tiếng Nhật'), ('NNN15', N'Tiếng Nhật'), ('NNN16', N'Tiếng Nhật'), ('NNN17', N'Tiếng Nhật'), ('NNN18', N'Tiếng Nhật'), ('NNN19', N'Tiếng Nhật'), ('NNN20', N'Tiếng Nhật'),

-- ================= TIẾNG TRUNG =================
('NNT01', N'Tiếng Trung'), ('NNT02', N'Tiếng Trung'), ('NNT03', N'Tiếng Trung'), ('NNT04', N'Tiếng Trung'), ('NNT05', N'Tiếng Trung'), ('NNT06', N'Tiếng Trung'), ('NNT07', N'Tiếng Trung'), ('NNT08', N'Tiếng Trung'), ('NNT09', N'Tiếng Trung'), ('NNT10', N'Tiếng Trung'), 
('NNT11', N'Tiếng Trung'), ('NNT12', N'Tiếng Trung'), ('NNT13', N'Tiếng Trung'), ('NNT14', N'Tiếng Trung'), ('NNT15', N'Tiếng Trung'), ('NNT16', N'Tiếng Trung'), ('NNT17', N'Tiếng Trung'), ('NNT18', N'Tiếng Trung'), ('NNT19', N'Tiếng Trung'), ('NNT20', N'Tiếng Trung');
GO





-- Tạo bảng Class
CREATE TABLE Class (
    classID NVARCHAR(20) PRIMARY KEY,
    class_name NVARCHAR(100) NOT NULL,
    courseID NVARCHAR(20) NOT NULL,
    teacherID NVARCHAR(20) NOT NULL,
    start_date DATE NOT NULL,
    end_date DATE NOT NULL,
    capacity INT NOT NULL,
    CONSTRAINT FK_Class_Teacher FOREIGN KEY (teacherID) REFERENCES accountList(Id)
);
GO
-- Dữ liệu mẫu Class
INSERT INTO Class (classID, class_name, courseID, teacherID, start_date, end_date, capacity)
VALUES
-- ================= TOÁN (Txx + Tháng/Năm bắt đầu mở lớp) =================
(N'T10.0425', N'Lớp Toán 10 K001', 'T10', 'T01', '2025-04-01', '2026-09-01', 25),
(N'T10.0825', N'Lớp Toán 10 K002', 'T10', 'T02', '2025-08-01', '2026-01-01', 30),
(N'T10.1125', N'Lớp Toán 10 K003', 'T10', 'T03', '2025-11-01', '2026-04-01', 25),
(N'T10.1225', N'Lớp Toán 10 K004', 'T10', 'T04', '2025-12-01', '2026-05-01', 30),
(N'T10.0126', N'Lớp Toán 10 K005', 'T10', 'T05', '2026-01-01', '2026-06-01', 25),
(N'T10.0326', N'Lớp Toán 10 K006', 'T10', 'T06', '2026-03-01', '2026-08-01', 25),
(N'T10.0426', N'Lớp Toán 10 K007', 'T10', 'T07', '2026-04-01', '2026-09-01', 30),
(N'T10.0626', N'Lớp Toán 10 K008', 'T10', 'T08', '2026-06-01', '2026-11-01', 25),

(N'T11.0425', N'Lớp Toán 11 K001', 'T11', 'T09', '2025-04-01', '2026-09-01', 25),
(N'T11.0825', N'Lớp Toán 11 K002', 'T11', 'T10', '2025-08-01', '2026-01-01', 30),
(N'T11.1125', N'Lớp Toán 11 K003', 'T11', 'T11', '2025-11-01', '2026-04-01', 25),
(N'T11.1225', N'Lớp Toán 11 K004', 'T11', 'T12', '2025-12-01', '2026-05-01', 30),
(N'T11.0126', N'Lớp Toán 11 K005', 'T11', 'T13', '2026-01-01', '2026-06-01', 25),
(N'T11.0326', N'Lớp Toán 11 K006', 'T11', 'T14', '2026-03-01', '2026-08-01', 25),
(N'T11.0426', N'Lớp Toán 11 K007', 'T11', 'T15', '2026-04-01', '2026-09-01', 30),
(N'T11.0626', N'Lớp Toán 11 K008', 'T11', 'T16', '2026-06-01', '2026-11-01', 25),

(N'T12.0425', N'Lớp Toán 12 K001', 'T12', 'T17', '2025-04-01', '2026-09-01', 25),
(N'T12.0825', N'Lớp Toán 12 K002', 'T12', 'T18', '2025-08-01', '2026-01-01', 30),
(N'T12.1125', N'Lớp Toán 12 K003', 'T12', 'T19', '2025-11-01', '2026-04-01', 25),
(N'T12.1225', N'Lớp Toán 12 K004', 'T12', 'T20', '2025-12-01', '2026-05-01', 30),
(N'T12.0126', N'Lớp Toán 12 K005', 'T12', 'T01', '2026-01-01', '2026-06-01', 25),
(N'T12.0326', N'Lớp Toán 12 K006', 'T12', 'T02', '2026-03-01', '2026-08-01', 25),
(N'T12.0426', N'Lớp Toán 12 K007', 'T12', 'T03', '2026-04-01', '2026-09-01', 30),
(N'T12.0626', N'Lớp Toán 12 K008', 'T12', 'T05', '2026-06-01', '2026-11-01', 25),

-- ================= VĂN (Vxx + Tháng/Năm bắt đầu mở lớp) =================
(N'V10.0425', N'Lớp Văn 10 K001', 'V10', 'V01', '2025-04-01', '2026-09-01', 25),
(N'V10.0825', N'Lớp Văn 10 K002', 'V10', 'V02', '2025-08-01', '2026-01-01', 30),
(N'V10.1125', N'Lớp Văn 10 K003', 'V10', 'V03', '2025-11-01', '2026-04-01', 25),
(N'V10.1225', N'Lớp Văn 10 K004', 'V10', 'V04', '2025-12-01', '2026-05-01', 30),
(N'V10.0126', N'Lớp Văn 10 K005', 'V10', 'V05', '2026-01-01', '2026-06-01', 25),
(N'V10.0326', N'Lớp Văn 10 K006', 'V10', 'V06', '2026-03-01', '2026-08-01', 25),
(N'V10.0426', N'Lớp Văn 10 K007', 'V10', 'V07', '2026-04-01', '2026-09-01', 30),
(N'V10.0626', N'Lớp Văn 10 K008', 'V10', 'V08', '2026-06-01', '2026-11-01', 25),

(N'V11.0425', N'Lớp Văn 11 K001', 'V11', 'V09', '2025-04-01', '2026-09-01', 25),
(N'V11.0825', N'Lớp Văn 11 K002', 'V11', 'V10', '2025-08-01', '2026-01-01', 30),
(N'V11.1125', N'Lớp Văn 11 K003', 'V11', 'V11', '2025-11-01', '2026-04-01', 25),
(N'V11.1225', N'Lớp Văn 11 K004', 'V11', 'V12', '2025-12-01', '2026-05-01', 30),
(N'V11.0126', N'Lớp Văn 11 K005', 'V11', 'V13', '2026-01-01', '2026-06-01', 25),
(N'V11.0326', N'Lớp Văn 11 K006', 'V11', 'V14', '2026-03-01', '2026-08-01', 25),
(N'V11.0426', N'Lớp Văn 11 K007', 'V11', 'V15', '2026-04-01', '2026-09-01', 30),
(N'V11.0626', N'Lớp Văn 11 K008', 'V11', 'V16', '2026-06-01', '2026-11-01', 25),

(N'V12.0425', N'Lớp Văn 12 K001', 'V12', 'V17', '2025-04-01', '2026-09-01', 25),
(N'V12.0825', N'Lớp Văn 12 K002', 'V12', 'V18', '2025-08-01', '2026-01-01', 30),
(N'V12.1125', N'Lớp Văn 12 K003', 'V12', 'V19', '2025-11-01', '2026-04-01', 25),
(N'V12.1225', N'Lớp Văn 12 K004', 'V12', 'V20', '2025-12-01', '2026-05-01', 30),
(N'V12.0126', N'Lớp Văn 12 K005', 'V12', 'V01', '2026-01-01', '2026-06-01', 25),
(N'V12.0326', N'Lớp Văn 12 K006', 'V12', 'V02', '2026-03-01', '2026-08-01', 25),
(N'V12.0426', N'Lớp Văn 12 K007', 'V12', 'V03', '2026-04-01', '2026-09-01', 30),
(N'V12.0626', N'Lớp Văn 12 K008', 'V12', 'V05', '2026-06-01', '2026-11-01', 25),

-- ================= HÓA (Hxx + Tháng/Năm bắt đầu mở lớp) =================
(N'H10.0425', N'Lớp Hóa 10 K001', 'H10', 'H01', '2025-04-01', '2026-09-01', 25),
(N'H10.0825', N'Lớp Hóa 10 K002', 'H10', 'H02', '2025-08-01', '2026-01-01', 30),
(N'H10.1125', N'Lớp Hóa 10 K003', 'H10', 'H03', '2025-11-01', '2026-04-01', 25),
(N'H10.1225', N'Lớp Hóa 10 K004', 'H10', 'H04', '2025-12-01', '2026-05-01', 30),
(N'H10.0126', N'Lớp Hóa 10 K005', 'H10', 'H05', '2026-01-01', '2026-06-01', 25),
(N'H10.0326', N'Lớp Hóa 10 K006', 'H10', 'H06', '2026-03-01', '2026-08-01', 25),
(N'H10.0426', N'Lớp Hóa 10 K007', 'H10', 'H07', '2026-04-01', '2026-09-01', 30),
(N'H10.0626', N'Lớp Hóa 10 K008', 'H10', 'H08', '2026-06-01', '2026-11-01', 25),

(N'H11.0425', N'Lớp Hóa 11 K001', 'H11', 'H09', '2025-04-01', '2026-09-01', 25),
(N'H11.0825', N'Lớp Hóa 11 K002', 'H11', 'H10', '2025-08-01', '2026-01-01', 30),
(N'H11.1125', N'Lớp Hóa 11 K003', 'H11', 'H11', '2025-11-01', '2026-04-01', 25),
(N'H11.1225', N'Lớp Hóa 11 K004', 'H11', 'H12', '2025-12-01', '2026-05-01', 30),
(N'H11.0126', N'Lớp Hóa 11 K005', 'H11', 'H13', '2026-01-01', '2026-06-01', 25),
(N'H11.0326', N'Lớp Hóa 11 K006', 'H11', 'H14', '2026-03-01', '2026-08-01', 25),
(N'H11.0426', N'Lớp Hóa 11 K007', 'H11', 'H15', '2026-04-01', '2026-09-01', 30),
(N'H11.0626', N'Lớp Hóa 11 K008', 'H11', 'H16', '2026-06-01', '2026-11-01', 25),

(N'H12.0425', N'Lớp Hóa 12 K001', 'H12', 'H17', '2025-04-01', '2026-09-01', 25),
(N'H12.0825', N'Lớp Hóa 12 K002', 'H12', 'H18', '2025-08-01', '2026-01-01', 30),
(N'H12.1125', N'Lớp Hóa 12 K003', 'H12', 'H19', '2025-11-01', '2026-04-01', 25),
(N'H12.1225', N'Lớp Hóa 12 K004', 'H12', 'H20', '2025-12-01', '2026-05-01', 30),
(N'H12.0126', N'Lớp Hóa 12 K005', 'H12', 'H01', '2026-01-01', '2026-06-01', 25),
(N'H12.0326', N'Lớp Hóa 12 K006', 'H12', 'H02', '2026-03-01', '2026-08-01', 25),
(N'H12.0426', N'Lớp Hóa 12 K007', 'H12', 'H03', '2026-04-01', '2026-09-01', 30),
(N'H12.0626', N'Lớp Hóa 12 K008', 'H12', 'H05', '2026-06-01', '2026-11-01', 25),


-- ================= LÝ (Lxx + Tháng/Năm bắt đầu mở lớp) =================
(N'L10.0425', N'Lớp Lý 10 K001', 'L10', 'L01', '2025-04-01', '2026-09-01', 25),
(N'L10.0825', N'Lớp Lý 10 K002', 'L10', 'L02', '2025-08-01', '2026-01-01', 30),
(N'L10.1125', N'Lớp Lý 10 K003', 'L10', 'L03', '2025-11-01', '2026-04-01', 25),
(N'L10.1225', N'Lớp Lý 10 K004', 'L10', 'L04', '2025-12-01', '2026-05-01', 30),
(N'L10.0126', N'Lớp Lý 10 K005', 'L10', 'L05', '2026-01-01', '2026-06-01', 25),
(N'L10.0326', N'Lớp Lý 10 K006', 'L10', 'L06', '2026-03-01', '2026-08-01', 25),
(N'L10.0426', N'Lớp Lý 10 K007', 'L10', 'L07', '2026-04-01', '2026-09-01', 30),
(N'L10.0626', N'Lớp Lý 10 K008', 'L10', 'L08', '2026-06-01', '2026-11-01', 25),

(N'L11.0425', N'Lớp Lý 11 K001', 'L11', 'L09', '2025-04-01', '2026-09-01', 25),
(N'L11.0825', N'Lớp Lý 11 K002', 'L11', 'L10', '2025-08-01', '2026-01-01', 30),
(N'L11.1125', N'Lớp Lý 11 K003', 'L11', 'L11', '2025-11-01', '2026-04-01', 25),
(N'L11.1225', N'Lớp Lý 11 K004', 'L11', 'L12', '2025-12-01', '2026-05-01', 30),
(N'L11.0126', N'Lớp Lý 11 K005', 'L11', 'L13', '2026-01-01', '2026-06-01', 25),
(N'L11.0326', N'Lớp Lý 11 K006', 'L11', 'L14', '2026-03-01', '2026-08-01', 25),
(N'L11.0426', N'Lớp Lý 11 K007', 'L11', 'L15', '2026-04-01', '2026-09-01', 30),
(N'L11.0626', N'Lớp Lý 11 K008', 'L11', 'L16', '2026-06-01', '2026-11-01', 25),

(N'L12.0425', N'Lớp Lý 12 K001', 'L12', 'L17', '2025-04-01', '2026-09-01', 25),
(N'L12.0825', N'Lớp Lý 12 K002', 'L12', 'L18', '2025-08-01', '2026-01-01', 30),
(N'L12.1125', N'Lớp Lý 12 K003', 'L12', 'L19', '2025-11-01', '2026-04-01', 25),
(N'L12.1225', N'Lớp Lý 12 K004', 'L12', 'L20', '2025-12-01', '2026-05-01', 30),
(N'L12.0126', N'Lớp Lý 12 K005', 'L12', 'L01', '2026-01-01', '2026-06-01', 25),
(N'L12.0326', N'Lớp Lý 12 K006', 'L12', 'L02', '2026-03-01', '2026-08-01', 25),
(N'L12.0426', N'Lớp Lý 12 K007', 'L12', 'L03', '2026-04-01', '2026-09-01', 30),
(N'L12.0626', N'Lớp Lý 12 K008', 'L12', 'L05', '2026-06-01', '2026-11-01', 25),

-- ================= SINH (Sxx + Tháng/Năm bắt đầu mở lớp) =================
(N'S10.0425', N'Lớp Sinh 10 K001', 'S10', 'S01', '2025-04-01', '2026-09-01', 25),
(N'S10.0825', N'Lớp Sinh 10 K002', 'S10', 'S02', '2025-08-01', '2026-01-01', 30),
(N'S10.1125', N'Lớp Sinh 10 K003', 'S10', 'S03', '2025-11-01', '2026-04-01', 25),
(N'S10.1225', N'Lớp Sinh 10 K004', 'S10', 'S04', '2025-12-01', '2026-05-01', 30),
(N'S10.0126', N'Lớp Sinh 10 K005', 'S10', 'S05', '2026-01-01', '2026-06-01', 25),
(N'S10.0326', N'Lớp Sinh 10 K006', 'S10', 'S06', '2026-03-01', '2026-08-01', 25),
(N'S10.0426', N'Lớp Sinh 10 K007', 'S10', 'S07', '2026-04-01', '2026-09-01', 30),
(N'S10.0626', N'Lớp Sinh 10 K008', 'S10', 'S08', '2026-06-01', '2026-11-01', 25),

(N'S11.0425', N'Lớp Sinh 11 K001', 'S11', 'S09', '2025-04-01', '2026-09-01', 25),
(N'S11.0825', N'Lớp Sinh 11 K002', 'S11', 'S10', '2025-08-01', '2026-01-01', 30),
(N'S11.1125', N'Lớp Sinh 11 K003', 'S11', 'S11', '2025-11-01', '2026-04-01', 25),
(N'S11.1225', N'Lớp Sinh 11 K004', 'S11', 'S12', '2025-12-01', '2026-05-01', 30),
(N'S11.0126', N'Lớp Sinh 11 K005', 'S11', 'S13', '2026-01-01', '2026-06-01', 25),
(N'S11.0326', N'Lớp Sinh 11 K006', 'S11', 'S14', '2026-03-01', '2026-08-01', 25),
(N'S11.0426', N'Lớp Sinh 11 K007', 'S11', 'S15', '2026-04-01', '2026-09-01', 30),
(N'S11.0626', N'Lớp Sinh 11 K008', 'S11', 'S16', '2026-06-01', '2026-11-01', 25),

(N'S12.0425', N'Lớp Sinh 12 K001', 'S12', 'S17', '2025-04-01', '2026-09-01', 25),
(N'S12.0825', N'Lớp Sinh 12 K002', 'S12', 'S18', '2025-08-01', '2026-01-01', 30),
(N'S12.1125', N'Lớp Sinh 12 K003', 'S12', 'S19', '2025-11-01', '2026-04-01', 25),
(N'S12.1225', N'Lớp Sinh 12 K004', 'S12', 'S20', '2025-12-01', '2026-05-01', 30),
(N'S12.0126', N'Lớp Sinh 12 K005', 'S12', 'S01', '2026-01-01', '2026-06-01', 25),
(N'S12.0326', N'Lớp Sinh 12 K006', 'S12', 'S02', '2026-03-01', '2026-08-01', 25),
(N'S12.0426', N'Lớp Sinh 12 K007', 'S12', 'S03', '2026-04-01', '2026-09-01', 30),
(N'S12.0626', N'Lớp Sinh 12 K008', 'S12', 'S04', '2026-06-01', '2026-11-01', 25),

-- ================= TIẾNG ANH (NN01 + Tháng/Năm bắt đầu mở lớp) =================
(N'NN01.10.0425', N'Lớp Tiếng Anh 10 K001', 'NN01.10', 'NNA01', '2025-04-01', '2026-09-01', 25),
(N'NN01.10.0825', N'Lớp Tiếng Anh 10 K002', 'NN01.10', 'NNA02', '2025-08-01', '2026-01-01', 30),
(N'NN01.10.1125', N'Lớp Tiếng Anh 10 K003', 'NN01.10', 'NNA03', '2025-11-01', '2026-04-01', 25),
(N'NN01.10.1225', N'Lớp Tiếng Anh 10 K004', 'NN01.10', 'NNA04', '2025-12-01', '2026-05-01', 30),
(N'NN01.10.0126', N'Lớp Tiếng Anh 10 K005', 'NN01.10', 'NNA05', '2026-01-01', '2026-06-01', 25),
(N'NN01.10.0326', N'Lớp Tiếng Anh 10 K006', 'NN01.10', 'NNA06', '2026-03-01', '2026-08-01', 25),
(N'NN01.10.0426', N'Lớp Tiếng Anh 10 K007', 'NN01.10', 'NNA07', '2026-04-01', '2026-09-01', 30),
(N'NN01.10.0626', N'Lớp Tiếng Anh 10 K008', 'NN01.10', 'NNA08', '2026-06-01', '2026-11-01', 25),

(N'NN01.11.0425', N'Lớp Tiếng Anh 11 K001', 'NN01.11', 'NNA09', '2025-04-01', '2026-09-01', 25),
(N'NN01.11.0825', N'Lớp Tiếng Anh 11 K002', 'NN01.11', 'NNA10', '2025-08-01', '2026-01-01', 30),
(N'NN01.11.1125', N'Lớp Tiếng Anh 11 K003', 'NN01.11', 'NNA11', '2025-11-01', '2026-04-01', 25),
(N'NN01.11.1225', N'Lớp Tiếng Anh 11 K004', 'NN01.11', 'NNA12', '2025-12-01', '2026-05-01', 30),
(N'NN01.11.0126', N'Lớp Tiếng Anh 11 K005', 'NN01.11', 'NNA13', '2026-01-01', '2026-06-01', 25),
(N'NN01.11.0326', N'Lớp Tiếng Anh 11 K006', 'NN01.11', 'NNA14', '2026-03-01', '2026-08-01', 25),
(N'NN01.11.0426', N'Lớp Tiếng Anh 11 K007', 'NN01.11', 'NNA15', '2026-04-01', '2026-09-01', 30),
(N'NN01.11.0626', N'Lớp Tiếng Anh 11 K008', 'NN01.11', 'NNA16', '2026-06-01', '2026-11-01', 25),

(N'NN01.12.0425', N'Lớp Tiếng Anh 12 K001', 'NN01.12', 'NNA17', '2025-04-01', '2026-09-01', 25),
(N'NN01.12.0825', N'Lớp Tiếng Anh 12 K002', 'NN01.12', 'NNA18', '2025-08-01', '2026-01-01', 30),
(N'NN01.12.1125', N'Lớp Tiếng Anh 12 K003', 'NN01.12', 'NNA19', '2025-11-01', '2026-04-01', 25),
(N'NN01.12.1225', N'Lớp Tiếng Anh 12 K004', 'NN01.12', 'NNA20', '2025-12-01', '2026-05-01', 30),
(N'NN01.12.0126', N'Lớp Tiếng Anh 12 K005', 'NN01.12', 'NNA01', '2026-01-01', '2026-06-01', 25),
(N'NN01.12.0326', N'Lớp Tiếng Anh 12 K006', 'NN01.12', 'NNA02', '2026-03-01', '2026-08-01', 25),
(N'NN01.12.0426', N'Lớp Tiếng Anh 12 K007', 'NN01.12', 'NNA03', '2026-04-01', '2026-09-01', 30),
(N'NN01.12.0626', N'Lớp Tiếng Anh 12 K008', 'NN01.12', 'NNA05', '2026-06-01', '2026-11-01', 25),

-- ================= TIẾNG NHẬT (NN02 + Tháng/Năm bắt đầu mở lớp) =================
(N'NN02.N5.0425', N'Lớp Tiếng Nhật N5 K001', 'NN02.N5', 'NNN01', '2025-04-01', '2026-09-01', 25),
(N'NN02.N5.0825', N'Lớp Tiếng Nhật N5 K002', 'NN02.N5', 'NNN02', '2025-08-01', '2026-01-01', 30),
(N'NN02.N5.1125', N'Lớp Tiếng Nhật N5 K003', 'NN02.N5', 'NNN03', '2025-11-01', '2026-04-01', 25),
(N'NN02.N5.1225', N'Lớp Tiếng Nhật N5 K004', 'NN02.N5', 'NNN04', '2025-12-01', '2026-05-01', 30),
(N'NN02.N5.0126', N'Lớp Tiếng Nhật N5 K005', 'NN02.N5', 'NNN05', '2026-01-01', '2026-06-01', 25),
(N'NN02.N5.0326', N'Lớp Tiếng Nhật N5 K006', 'NN02.N5', 'NNN06', '2026-03-01', '2026-08-01', 25),
(N'NN02.N5.0426', N'Lớp Tiếng Nhật N5 K007', 'NN02.N5', 'NNN07', '2026-04-01', '2026-09-01', 30),
(N'NN02.N5.0626', N'Lớp Tiếng Nhật N5 K008', 'NN02.N5', 'NNN08', '2026-06-01', '2026-11-01', 25),

(N'NN02.N4.0425', N'Lớp Tiếng Nhật N4 K001', 'NN02.N4', 'NNN09', '2025-04-01', '2026-09-01', 25),
(N'NN02.N4.0825', N'Lớp Tiếng Nhật N4 K002', 'NN02.N4', 'NNN10', '2025-08-01', '2026-01-01', 30),
(N'NN02.N4.1125', N'Lớp Tiếng Nhật N4 K003', 'NN02.N4', 'NNN11', '2025-11-01', '2026-04-01', 25),
(N'NN02.N4.1225', N'Lớp Tiếng Nhật N4 K004', 'NN02.N4', 'NNN12', '2025-12-01', '2026-05-01', 30),
(N'NN02.N4.0126', N'Lớp Tiếng Nhật N4 K005', 'NN02.N4', 'NNN13', '2026-01-01', '2026-06-01', 25),
(N'NN02.N4.0326', N'Lớp Tiếng Nhật N4 K006', 'NN02.N4', 'NNN14', '2026-03-01', '2026-08-01', 25),
(N'NN02.N4.0426', N'Lớp Tiếng Nhật N4 K007', 'NN02.N4', 'NNN15', '2026-04-01', '2026-09-01', 30),
(N'NN02.N4.0626', N'Lớp Tiếng Nhật N4 K008', 'NN02.N4', 'NNN16', '2026-06-01', '2026-11-01', 25),

(N'NN02.N3.0425', N'Lớp Tiếng Nhật N3 K001', 'NN02.N3', 'NNN17', '2025-04-01', '2026-09-01', 25),
(N'NN02.N3.0825', N'Lớp Tiếng Nhật N3 K002', 'NN02.N3', 'NNN18', '2025-08-01', '2026-01-01', 30),
(N'NN02.N3.1125', N'Lớp Tiếng Nhật N3 K003', 'NN02.N3', 'NNN19', '2025-11-01', '2026-04-01', 25),
(N'NN02.N3.1225', N'Lớp Tiếng Nhật N3 K004', 'NN02.N3', 'NNN20', '2025-12-01', '2026-05-01', 30),
(N'NN02.N3.0126', N'Lớp Tiếng Nhật N3 K005', 'NN02.N3', 'NNN01', '2026-01-01', '2026-06-01', 25),
(N'NN02.N3.0326', N'Lớp Tiếng Nhật N3 K006', 'NN02.N3', 'NNN02', '2026-03-01', '2026-08-01', 25),
(N'NN02.N3.0426', N'Lớp Tiếng Nhật N3 K007', 'NN02.N3', 'NNN03', '2026-04-01', '2026-09-01', 30),
(N'NN02.N3.0626', N'Lớp Tiếng Nhật N3 K008', 'NN02.N3', 'NNN05', '2026-06-01', '2026-11-01', 25),


-- ================= TIẾNG TRUNG (NN03 + Tháng/Năm bắt đầu mở lớp) =================
(N'NN03.H1.0425', N'Lớp Tiếng Trung HSK1 K001', 'NN03.H1', 'NNT01', '2025-04-01', '2026-09-01', 25),
(N'NN03.H1.0825', N'Lớp Tiếng Trung HSK1 K002', 'NN03.H1', 'NNT02', '2025-08-01', '2026-01-01', 30),
(N'NN03.H1.1125', N'Lớp Tiếng Trung HSK1 K003', 'NN03.H1', 'NNT03', '2025-11-01', '2026-04-01', 25),
(N'NN03.H1.1225', N'Lớp Tiếng Trung HSK1 K004', 'NN03.H1', 'NNT04', '2025-12-01', '2026-05-01', 30),
(N'NN03.H1.0126', N'Lớp Tiếng Trung HSK1 K005', 'NN03.H1', 'NNT05', '2026-01-01', '2026-06-01', 25),
(N'NN03.H1.0326', N'Lớp Tiếng Trung HSK1 K006', 'NN03.H1', 'NNT06', '2026-03-01', '2026-08-01', 25),
(N'NN03.H1.0426', N'Lớp Tiếng Trung HSK1 K007', 'NN03.H1', 'NNT07', '2026-04-01', '2026-09-01', 30),
(N'NN03.H1.0626', N'Lớp Tiếng Trung HSK1 K008', 'NN03.H1', 'NNT08', '2026-06-01', '2026-11-01', 25),

(N'NN03.H2.0425', N'Lớp Tiếng Trung HSK2 K001', 'NN03.H2', 'NNT09', '2025-04-01', '2026-09-01', 25),
(N'NN03.H2.0825', N'Lớp Tiếng Trung HSK2 K002', 'NN03.H2', 'NNT10', '2025-08-01', '2026-01-01', 30),
(N'NN03.H2.1125', N'Lớp Tiếng Trung HSK2 K003', 'NN03.H2', 'NNT11', '2025-11-01', '2026-04-01', 25),
(N'NN03.H2.1225', N'Lớp Tiếng Trung HSK2 K004', 'NN03.H2', 'NNT12', '2025-12-01', '2026-05-01', 30),
(N'NN03.H2.0126', N'Lớp Tiếng Trung HSK2 K005', 'NN03.H2', 'NNT13', '2026-01-01', '2026-06-01', 25),
(N'NN03.H2.0326', N'Lớp Tiếng Trung HSK2 K006', 'NN03.H2', 'NNT14', '2026-03-01', '2026-08-01', 25),
(N'NN03.H2.0426', N'Lớp Tiếng Trung HSK2 K007', 'NN03.H2', 'NNT15', '2026-04-01', '2026-09-01', 30),
(N'NN03.H2.0626', N'Lớp Tiếng Trung HSK2 K008', 'NN03.H2', 'NNT16', '2026-06-01', '2026-11-01', 25),

(N'NN03.H3.0425', N'Lớp Tiếng Trung HSK3 K001', 'NN03.H3', 'NNT17', '2025-04-01', '2026-09-01', 25),
(N'NN03.H3.0825', N'Lớp Tiếng Trung HSK3 K002', 'NN03.H3', 'NNT18', '2025-08-01', '2026-01-01', 30),
(N'NN03.H3.1125', N'Lớp Tiếng Trung HSK3 K003', 'NN03.H3', 'NNT19', '2025-11-01', '2026-04-01', 25),
(N'NN03.H3.1225', N'Lớp Tiếng Trung HSK3 K004', 'NN03.H3', 'NNT20', '2025-12-01', '2026-05-01', 30),
(N'NN03.H3.0126', N'Lớp Tiếng Trung HSK3 K005', 'NN03.H3', 'NNT01', '2026-01-01', '2026-06-01', 25),
(N'NN03.H3.0326', N'Lớp Tiếng Trung HSK3 K006', 'NN03.H3', 'NNT02', '2026-03-01', '2026-08-01', 25),
(N'NN03.H3.0426', N'Lớp Tiếng Trung HSK3 K007', 'NN03.H3', 'NNT03', '2026-04-01', '2026-09-01', 30),
(N'NN03.H3.0626', N'Lớp Tiếng Trung HSK3 K008', 'NN03.H3', 'NNT04', '2026-06-01', '2026-11-01', 25);
GO






-- Tạo bảng JoinClass
CREATE TABLE JoinClass (
    AccountID NVARCHAR(20) NOT NULL,
    classID NVARCHAR(20) NOT NULL,
    PRIMARY KEY (AccountID, classID),
    CONSTRAINT FK_JoinClass_Account FOREIGN KEY (AccountID) REFERENCES accountList(Id),
    CONSTRAINT FK_JoinClass_Class FOREIGN KEY (classID) REFERENCES Class(classID)
);
GO

-- Dữ liệu mẫu JoinClass
INSERT INTO JoinClass (AccountID, classID)
VALUES
--================ MÔN TOÁN ================

--========== Khối 10 (Học sinh Khóa 2010) ==========

--===== Lớp Toán 10 K001 - T10.0425 (Capacity: 25) =====
('10110001', 'T10.0425'), ('10110002', 'T10.0425'), ('10110003', 'T10.0425'), ('10110004', 'T10.0425'), ('10110005', 'T10.0425'),
('10210001', 'T10.0425'), ('10210002', 'T10.0425'), ('10210003', 'T10.0425'), ('10210004', 'T10.0425'), ('10210005', 'T10.0425'),
('10110006', 'T10.0425'), ('10210006', 'T10.0425'),

--===== Lớp Toán 10 K002 - T10.0825 (Capacity: 30) =====
('10110007', 'T10.0825'), ('10110008', 'T10.0825'), ('10110009', 'T10.0825'), ('10110010', 'T10.0825'), ('10110011', 'T10.0825'),
('10210007', 'T10.0825'), ('10210008', 'T10.0825'), ('10210009', 'T10.0825'), ('10210010', 'T10.0825'), ('10210011', 'T10.0825'),
('10110012', 'T10.0825'), ('10210012', 'T10.0825'), ('10110013', 'T10.0825'),

--===== Lớp Toán 10 K003 - T10.1125 (Capacity: 25) =====
('10110014', 'T10.1125'), ('10110015', 'T10.1125'), ('10110016', 'T10.1125'), ('10110017', 'T10.1125'), ('10110018', 'T10.1125'),
('10210013', 'T10.1125'), ('10210014', 'T10.1125'), ('10210015', 'T10.1125'), ('10210016', 'T10.1125'), ('10210017', 'T10.1125'),
('10110019', 'T10.1125'), ('10210018', 'T10.1125'),

--===== Lớp Toán 10 K004 - T10.1225 (Capacity: 30) =====
('10110020', 'T10.1225'), ('10110021', 'T10.1225'), ('10110022', 'T10.1225'), ('10110023', 'T10.1225'), ('10110024', 'T10.1225'),
('10210019', 'T10.1225'), ('10210020', 'T10.1225'), ('10210021', 'T10.1225'), ('10210022', 'T10.1225'), ('10210023', 'T10.1225'),
('10110025', 'T10.1225'), ('10210024', 'T10.1225'), ('10110026', 'T10.1225'),

--===== Lớp Toán 10 K005 - T10.0126 (Capacity: 25) =====
('10110027', 'T10.0126'), ('10110028', 'T10.0126'), ('10110029', 'T10.0126'), ('10110030', 'T10.0126'), ('10110031', 'T10.0126'),
('10210025', 'T10.0126'), ('10210026', 'T10.0126'), ('10210027', 'T10.0126'), ('10210028', 'T10.0126'), ('10210029', 'T10.0126'),
('10110032', 'T10.0126'), ('10210030', 'T10.0126'),

--===== Lớp Toán 10 K006 - T10.0326 (Capacity: 25) =====
('10110033', 'T10.0326'), ('10110034', 'T10.0326'), ('10110035', 'T10.0326'), ('10110036', 'T10.0326'), ('10110037', 'T10.0326'),
('10210031', 'T10.0326'), ('10210032', 'T10.0326'), ('10210033', 'T10.0326'), ('10210034', 'T10.0326'), ('10210035', 'T10.0326'),

--===== Lớp Toán 10 K007 - T10.0426 (Capacity: 30) =====
('10110038', 'T10.0426'), ('10110039', 'T10.0426'), ('10110040', 'T10.0426'), ('10110041', 'T10.0426'), ('10110042', 'T10.0426'),
('10210036', 'T10.0426'), ('10210037', 'T10.0426'), ('10210038', 'T10.0426'), ('10210039', 'T10.0426'), ('10210040', 'T10.0426'),
('10110043', 'T10.0426'), ('10210041', 'T10.0426'),

--===== Lớp Toán 10 K008 - T10.0626 (Capacity: 25) =====
('10110044', 'T10.0626'), ('10110045', 'T10.0626'), ('10110046', 'T10.0626'), ('10110047', 'T10.0626'), ('10110048', 'T10.0626'),
('10110049', 'T10.0626'), ('10110050', 'T10.0626'), ('10210042', 'T10.0626'), ('10210043', 'T10.0626'), ('10210044', 'T10.0626'),
('10210045', 'T10.0626'), ('10210046', 'T10.0626'), ('10210047', 'T10.0626'), ('10210048', 'T10.0626'), ('10210049', 'T10.0626'), ('10210050', 'T10.0626'),


--========== Khối 11 (Học sinh Khóa 2009) ==========

--===== Lớp Toán 11 K001 - T11.0425 (Capacity: 25) =====
('10109001', 'T11.0425'), ('10109002', 'T11.0425'), ('10109003', 'T11.0425'), ('10109004', 'T11.0425'), ('10109005', 'T11.0425'),
('10209001', 'T11.0425'), ('10209002', 'T11.0425'), ('10209003', 'T11.0425'), ('10209004', 'T11.0425'), ('10209005', 'T11.0425'),

--===== Lớp Toán 11 K002 - T11.0825 (Capacity: 30) =====
('10109006', 'T11.0825'), ('10109007', 'T11.0825'), ('10109008', 'T11.0825'), ('10109009', 'T11.0825'), ('10109010', 'T11.0825'),
('10209006', 'T11.0825'), ('10209007', 'T11.0825'), ('10209008', 'T11.0825'), ('10209009', 'T11.0825'), ('10209010', 'T11.0825'),

--===== Lớp Toán 11 K003 - T11.1125 (Capacity: 25) =====
('10109011', 'T11.1125'), ('10109012', 'T11.1125'), ('10109013', 'T11.1125'), ('10109014', 'T11.1125'), ('10109015', 'T11.1125'),
('10209011', 'T11.1125'), ('10209012', 'T11.1125'), ('10209013', 'T11.1125'), ('10209014', 'T11.1125'), ('10209015', 'T11.1125'),

--===== Lớp Toán 11 K004 - T11.1225 (Capacity: 30) =====
('10109016', 'T11.1225'), ('10109017', 'T11.1225'), ('10109018', 'T11.1225'), ('10109019', 'T11.1225'), ('10109020', 'T11.1225'),
('10209016', 'T11.1225'), ('10209017', 'T11.1225'), ('10209018', 'T11.1225'), ('10209019', 'T11.1225'), ('10209020', 'T11.1225'),

--===== Lớp Toán 11 K005 - T11.0126 (Capacity: 25) =====
('10109021', 'T11.0126'), ('10109022', 'T11.0126'), ('10109023', 'T11.0126'), ('10109024', 'T11.0126'), ('10109025', 'T11.0126'),
('10209021', 'T11.0126'), ('10209022', 'T11.0126'), ('10209023', 'T11.0126'), ('10209024', 'T11.0126'), ('10209025', 'T11.0126'),

--===== Lớp Toán 11 K006 - T11.0326 (Capacity: 25) =====
('10109026', 'T11.0326'), ('10109027', 'T11.0326'), ('10109028', 'T11.0326'), ('10109029', 'T11.0326'), ('10109030', 'T11.0326'),
('10209026', 'T11.0326'), ('10209027', 'T11.0326'), ('10209028', 'T11.0326'), ('10209029', 'T11.0326'), ('10209030', 'T11.0326'),

--===== Lớp Toán 11 K007 - T11.0426 (Capacity: 30) =====
('10109031', 'T11.0426'), ('10109032', 'T11.0426'), ('10109033', 'T11.0426'), ('10109034', 'T11.0426'), ('10109035', 'T11.0426'),
('10209031', 'T11.0426'), ('10209032', 'T11.0426'), ('10209033', 'T11.0426'), ('10209034', 'T11.0426'), ('10209035', 'T11.0426'),

--===== Lớp Toán 11 K008 - T11.0626 (Capacity: 25) =====
('10109036', 'T11.0626'), ('10109037', 'T11.0626'), ('10109038', 'T11.0626'), ('10109039', 'T11.0626'), ('10109040', 'T11.0626'),
('10209036', 'T11.0626'), ('10209037', 'T11.0626'), ('10209038', 'T11.0626'), ('10209039', 'T11.0626'), ('10209040', 'T11.0626'),



--================ MÔN VĂN ================

--========== Khối 10 (Học sinh Khóa 2010) ==========

--===== Lớp Văn 10 K001 - V10.0425 (Capacity: 25) =====
('10110001', 'V10.0425'), ('10110002', 'V10.0425'), ('10110003', 'V10.0425'), ('10110004', 'V10.0425'), ('10110005', 'V10.0425'),
('10210001', 'V10.0425'), ('10210002', 'V10.0425'), ('10210003', 'V10.0425'), ('10210004', 'V10.0425'), ('10210005', 'V10.0425'),
('10110026', 'V10.0425'), ('10210026', 'V10.0425'),

--===== Lớp Văn 10 K002 - V10.0825 (Capacity: 30) =====
('10110006', 'V10.0825'), ('10110007', 'V10.0825'), ('10110008', 'V10.0825'), ('10110009', 'V10.0825'), ('10110010', 'V10.0825'),
('10210006', 'V10.0825'), ('10210007', 'V10.0825'), ('10210008', 'V10.0825'), ('10210009', 'V10.0825'), ('10210010', 'V10.0825'),
('10110027', 'V10.0825'), ('10210027', 'V10.0825'), ('10110028', 'V10.0825'),

--===== Lớp Văn 10 K003 - V10.1125 (Capacity: 25) =====
('10110011', 'V10.1125'), ('10110012', 'V10.1125'), ('10110013', 'V10.1125'), ('10110014', 'V10.1125'), ('10110015', 'V10.1125'),
('10210011', 'V10.1125'), ('10210012', 'V10.1125'), ('10210013', 'V10.1125'), ('10210014', 'V10.1125'), ('10210015', 'V10.1125'),
('10110029', 'V10.1125'), ('10210029', 'V10.1125'),

--===== Lớp Văn 10 K004 - V10.1225 (Capacity: 30) =====
('10110016', 'V10.1225'), ('10110017', 'V10.1225'), ('10110018', 'V10.1225'), ('10110019', 'V10.1225'), ('10110020', 'V10.1225'),
('10210016', 'V10.1225'), ('10210017', 'V10.1225'), ('10210018', 'V10.1225'), ('10210019', 'V10.1225'), ('10210020', 'V10.1225'),
('10110030', 'V10.1225'), ('10210030', 'V10.1225'), ('10110031', 'V10.1225'),

--===== Lớp Văn 10 K005 - V10.0126 (Capacity: 25) =====
('10110021', 'V10.0126'), ('10110022', 'V10.0126'), ('10110023', 'V10.0126'), ('10110024', 'V10.0126'), ('10110025', 'V10.0126'),
('10210021', 'V10.0126'), ('10210022', 'V10.0126'), ('10210023', 'V10.0126'), ('10210024', 'V10.0126'), ('10210025', 'V10.0126'),
('10110032', 'V10.0126'), ('10210032', 'V10.0126'),

--===== Lớp Văn 10 K006 - V10.0326 (Capacity: 25) =====
('10110033', 'V10.0326'), ('10110034', 'V10.0326'), ('10110035', 'V10.0326'), ('10210033', 'V10.0326'), ('10210034', 'V10.0326'),
('10210035', 'V10.0326'), ('10110036', 'V10.0326'), ('10110037', 'V10.0326'), ('10210036', 'V10.0326'), ('10210037', 'V10.0326'),

--===== Lớp Văn 10 K007 - V10.0426 (Capacity: 30) =====
('10110038', 'V10.0426'), ('10110039', 'V10.0426'), ('10110040', 'V10.0426'), ('10110041', 'V10.0426'), ('10110042', 'V10.0426'),
('10210038', 'V10.0426'), ('10210039', 'V10.0426'), ('10210040', 'V10.0426'), ('10210041', 'V10.0426'), ('10210042', 'V10.0426'),
('10110043', 'V10.0426'), ('10210043', 'V10.0426'),

--===== Lớp Văn 10 K008 - V10.0626 (Capacity: 25) =====
('10110044', 'V10.0626'), ('10110045', 'V10.0626'), ('10110046', 'V10.0626'), ('10110047', 'V10.0626'), ('10110048', 'V10.0626'),
('10210044', 'V10.0626'), ('10210045', 'V10.0626'), ('10210046', 'V10.0626'), ('10210047', 'V10.0626'), ('10210048', 'V10.0626'),
('10110049', 'V10.0626'), ('10210049', 'V10.0626'),


--========== Khối 11 (Học sinh Khóa 2009) ==========

--===== Lớp Văn 11 K001 - V11.0425 (Capacity: 25) =====
('10109001', 'V11.0425'), ('10109002', 'V11.0425'), ('10109003', 'V11.0425'), ('10109004', 'V11.0425'), ('10109005', 'V11.0425'),
('10209001', 'V11.0425'), ('10209002', 'V11.0425'), ('10209003', 'V11.0425'), ('10209004', 'V11.0425'), ('10209005', 'V11.0425'),

--===== Lớp Văn 11 K002 - V11.0825 (Capacity: 30) =====
('10109006', 'V11.0825'), ('10109007', 'V11.0825'), ('10109008', 'V11.0825'), ('10109009', 'V11.0825'), ('10109010', 'V11.0825'),
('10209006', 'V11.0825'), ('10209007', 'V11.0825'), ('10209008', 'V11.0825'), ('10209009', 'V11.0825'), ('10209010', 'V11.0825'),

--===== Lớp Văn 11 K003 - V11.1125 (Capacity: 25) =====
('10109011', 'V11.1125'), ('10109012', 'V11.1125'), ('10109013', 'V11.1125'), ('10109014', 'V11.1125'), ('10109015', 'V11.1125'),
('10209011', 'V11.1125'), ('10209012', 'V11.1125'), ('10209013', 'V11.1125'), ('10209014', 'V11.1125'), ('10209015', 'V11.1125'),

--===== Lớp Văn 11 K004 - V11.1225 (Capacity: 30) =====
('10109016', 'V11.1225'), ('10109017', 'V11.1225'), ('10109018', 'V11.1225'), ('10109019', 'V11.1225'), ('10109020', 'V11.1225'),
('10209016', 'V11.1225'), ('10209017', 'V11.1225'), ('10209018', 'V11.1225'), ('10209019', 'V11.1225'), ('10209020', 'V11.1225'),

--===== Lớp Văn 11 K005 - V11.0126 (Capacity: 25) =====
('10109021', 'V11.0126'), ('10109022', 'V11.0126'), ('10109023', 'V11.0126'), ('10109024', 'V11.0126'), ('10109025', 'V11.0126'),
('10209021', 'V11.0126'), ('10209022', 'V11.0126'), ('10209023', 'V11.0126'), ('10209024', 'V11.0126'), ('10209025', 'V11.0126'),

--===== Lớp Văn 11 K006 - V11.0326 (Capacity: 25) =====
('10109026', 'V11.0326'), ('10109027', 'V11.0326'), ('10109028', 'V11.0326'), ('10109029', 'V11.0326'), ('10109030', 'V11.0326'),
('10209026', 'V11.0326'), ('10209027', 'V11.0326'), ('10209028', 'V11.0326'), ('10209029', 'V11.0326'), ('10209030', 'V11.0326'),

--===== Lớp Văn 11 K007 - V11.0426 (Capacity: 30) =====
('10109031', 'V11.0426'), ('10109032', 'V11.0426'), ('10109033', 'V11.0426'), ('10109034', 'V11.0426'), ('10109035', 'V11.0426'),
('10209031', 'V11.0426'), ('10209032', 'V11.0426'), ('10209033', 'V11.0426'), ('10209034', 'V11.0426'), ('10209035', 'V11.0426'),

--===== Lớp Văn 11 K008 - V11.0626 (Capacity: 25) =====
('10109036', 'V11.0626'), ('10109037', 'V11.0626'), ('10109038', 'V11.0626'), ('10109039', 'V11.0626'), ('10109040', 'V11.0626'),
('10209036', 'V11.0626'), ('10209037', 'V11.0626'), ('10209038', 'V11.0626'), ('10209039', 'V11.0626'), ('10209040', 'V11.0626'),



--================ MÔN LÝ ================

--========== Khối 10 (Học sinh Khóa 2010) ==========

--===== Lớp Lý 10 K001 - L10.0425 (Capacity: 25) =====
('10110001', 'L10.0425'), ('10110002', 'L10.0425'), ('10110003', 'L10.0425'), ('10110004', 'L10.0425'), ('10110005', 'L10.0425'),
('10210001', 'L10.0425'), ('10210002', 'L10.0425'), ('10210003', 'L10.0425'), ('10210004', 'L10.0425'), ('10210005', 'L10.0425'),
('10110006', 'L10.0425'), ('10210006', 'L10.0425'),

--===== Lớp Lý 10 K002 - L10.0825 (Capacity: 30) =====
('10110007', 'L10.0825'), ('10110008', 'L10.0825'), ('10110009', 'L10.0825'), ('10110010', 'L10.0825'), ('10110011', 'L10.0825'),
('10210007', 'L10.0825'), ('10210008', 'L10.0825'), ('10210009', 'L10.0825'), ('10210010', 'L10.0825'), ('10210011', 'L10.0825'),
('10110012', 'L10.0825'), ('10210012', 'L10.0825'), ('10110013', 'L10.0825'),

--===== Lớp Lý 10 K003 - L10.1125 (Capacity: 25) =====
('10110014', 'L10.1125'), ('10110015', 'L10.1125'), ('10110016', 'L10.1125'), ('10110017', 'L10.1125'), ('10110018', 'L10.1125'),
('10210013', 'L10.1125'), ('10210014', 'L10.1125'), ('10210015', 'L10.1125'), ('10210016', 'L10.1125'), ('10210017', 'L10.1125'),
('10110019', 'L10.1125'), ('10210018', 'L10.1125'),

--===== Lớp Lý 10 K004 - L10.1225 (Capacity: 30) =====
('10110020', 'L10.1225'), ('10110021', 'L10.1225'), ('10110022', 'L10.1225'), ('10110023', 'L10.1225'), ('10110024', 'L10.1225'),
('10210019', 'L10.1225'), ('10210020', 'L10.1225'), ('10210021', 'L10.1225'), ('10210022', 'L10.1225'), ('10210023', 'L10.1225'),
('10110025', 'L10.1225'), ('10210024', 'L10.1225'), ('10110026', 'L10.1225'),

--===== Lớp Lý 10 K005 - L10.0126 (Capacity: 25) =====
('10110027', 'L10.0126'), ('10110028', 'L10.0126'), ('10110029', 'L10.0126'), ('10110030', 'L10.0126'), ('10110031', 'L10.0126'),
('10210025', 'L10.0126'), ('10210026', 'L10.0126'), ('10210027', 'L10.0126'), ('10210028', 'L10.0126'), ('10210029', 'L10.0126'),
('10110032', 'L10.0126'), ('10210030', 'L10.0126'),

--===== Lớp Lý 10 K006 - L10.0326 (Capacity: 25) =====
('10110033', 'L10.0326'), ('10110034', 'L10.0326'), ('10110035', 'L10.0326'), ('10110036', 'L10.0326'), ('10110037', 'L10.0326'),
('10210031', 'L10.0326'), ('10210032', 'L10.0326'), ('10210033', 'L10.0326'), ('10210034', 'L10.0326'), ('10210035', 'L10.0326'),

--===== Lớp Lý 10 K007 - L10.0426 (Capacity: 30) =====
('10110038', 'L10.0426'), ('10110039', 'L10.0426'), ('10110040', 'L10.0426'), ('10110041', 'L10.0426'), ('10110042', 'L10.0426'),
('10210036', 'L10.0426'), ('10210037', 'L10.0426'), ('10210038', 'L10.0426'), ('10210039', 'L10.0426'), ('10210040', 'L10.0426'),
('10110043', 'L10.0426'), ('10210041', 'L10.0426'),

--===== Lớp Lý 10 K008 - L10.0626 (Capacity: 25) =====
('10110044', 'L10.0626'), ('10110045', 'L10.0626'), ('10110046', 'L10.0626'), ('10110047', 'L10.0626'), ('10110048', 'L10.0626'),
('10110049', 'L10.0626'), ('10110050', 'L10.0626'), ('10210042', 'L10.0626'), ('10210043', 'L10.0626'), ('10210044', 'L10.0626'),
('10210045', 'L10.0626'), ('10210046', 'L10.0626'), ('10210047', 'L10.0626'), ('10210048', 'L10.0626'), ('10210049', 'L10.0626'), ('10210050', 'L10.0626'),


--========== Khối 11 (Học sinh Khóa 2009) ==========

--===== Lớp Lý 11 K001 - L11.0425 (Capacity: 25) =====
('10109001', 'L11.0425'), ('10109002', 'L11.0425'), ('10109003', 'L11.0425'), ('10109004', 'L11.0425'), ('10109005', 'L11.0425'),
('10209001', 'L11.0425'), ('10209002', 'L11.0425'), ('10209003', 'L11.0425'), ('10209004', 'L11.0425'), ('10209005', 'L11.0425'),

--===== Lớp Lý 11 K002 - L11.0825 (Capacity: 30) =====
('10109006', 'L11.0825'), ('10109007', 'L11.0825'), ('10109008', 'L11.0825'), ('10109009', 'L11.0825'), ('10109010', 'L11.0825'),
('10209006', 'L11.0825'), ('10209007', 'L11.0825'), ('10209008', 'L11.0825'), ('10209009', 'L11.0825'), ('10209010', 'L11.0825'),

--===== Lớp Lý 11 K003 - L11.1125 (Capacity: 25) =====
('10109011', 'L11.1125'), ('10109012', 'L11.1125'), ('10109013', 'L11.1125'), ('10109014', 'L11.1125'), ('10109015', 'L11.1125'),
('10209011', 'L11.1125'), ('10209012', 'L11.1125'), ('10209013', 'L11.1125'), ('10209014', 'L11.1125'), ('10209015', 'L11.1125'),

--===== Lớp Lý 11 K004 - L11.1225 (Capacity: 30) =====
('10109016', 'L11.1225'), ('10109017', 'L11.1225'), ('10109018', 'L11.1225'), ('10109019', 'L11.1225'), ('10109020', 'L11.1225'),
('10209016', 'L11.1225'), ('10209017', 'L11.1225'), ('10209018', 'L11.1225'), ('10209019', 'L11.1225'), ('10209020', 'L11.1225'),

--===== Lớp Lý 11 K005 - L11.0126 (Capacity: 25) =====
('10109021', 'L11.0126'), ('10109022', 'L11.0126'), ('10109023', 'L11.0126'), ('10109024', 'L11.0126'), ('10109025', 'L11.0126'),
('10209021', 'L11.0126'), ('10209022', 'L11.0126'), ('10209023', 'L11.0126'), ('10209024', 'L11.0126'), ('10209025', 'L11.0126'),

--===== Lớp Lý 11 K006 - L11.0326 (Capacity: 25) =====
('10109026', 'L11.0326'), ('10109027', 'L11.0326'), ('10109028', 'L11.0326'), ('10109029', 'L11.0326'), ('10109030', 'L11.0326'),
('10209026', 'L11.0326'), ('10209027', 'L11.0326'), ('10209028', 'L11.0326'), ('10209029', 'L11.0326'), ('10209030', 'L11.0326'),

--===== Lớp Lý 11 K007 - L11.0426 (Capacity: 30) =====
('10109031', 'L11.0426'), ('10109032', 'L11.0426'), ('10109033', 'L11.0426'), ('10109034', 'L11.0426'), ('10109035', 'L11.0426'),
('10209031', 'L11.0426'), ('10209032', 'L11.0426'), ('10209033', 'L11.0426'), ('10209034', 'L11.0426'), ('10209035', 'L11.0426'),

--===== Lớp Lý 11 K008 - L11.0626 (Capacity: 25) =====
('10109036', 'L11.0626'), ('10109037', 'L11.0626'), ('10109038', 'L11.0626'), ('10109039', 'L11.0626'), ('10109040', 'L11.0626'),
('10209036', 'L11.0626'), ('10209037', 'L11.0626'), ('10209038', 'L11.0626'), ('10209039', 'L11.0626'), ('10209040', 'L11.0626'),



--================ MÔN HÓA ================

--========== Khối 10 (Học sinh Khóa 2010) ==========

--===== Lớp Hóa 10 K001 - H10.0425 (Capacity: 25) =====
('10110001', 'H10.0425'), ('10110002', 'H10.0425'), ('10110003', 'H10.0425'), ('10110004', 'H10.0425'), ('10110005', 'H10.0425'),
('10210001', 'H10.0425'), ('10210002', 'H10.0425'), ('10210003', 'H10.0425'), ('10210004', 'H10.0425'), ('10210005', 'H10.0425'),
('10110006', 'H10.0425'), ('10210006', 'H10.0425'),

--===== Lớp Hóa 10 K002 - H10.0825 (Capacity: 30) =====
('10110007', 'H10.0825'), ('10110008', 'H10.0825'), ('10110009', 'H10.0825'), ('10110010', 'H10.0825'), ('10110011', 'H10.0825'),
('10210007', 'H10.0825'), ('10210008', 'H10.0825'), ('10210009', 'H10.0825'), ('10210010', 'H10.0825'), ('10210011', 'H10.0825'),
('10110012', 'H10.0825'), ('10210012', 'H10.0825'), ('10110013', 'H10.0825'),

--===== Lớp Hóa 10 K003 - H10.1125 (Capacity: 25) =====
('10110014', 'H10.1125'), ('10110015', 'H10.1125'), ('10110016', 'H10.1125'), ('10110017', 'H10.1125'), ('10110018', 'H10.1125'),
('10210013', 'H10.1125'), ('10210014', 'H10.1125'), ('10210015', 'H10.1125'), ('10210016', 'H10.1125'), ('10210017', 'H10.1125'),
('10110019', 'H10.1125'), ('10210018', 'H10.1125'),

--===== Lớp Hóa 10 K004 - H10.1225 (Capacity: 30) =====
('10110020', 'H10.1225'), ('10110021', 'H10.1225'), ('10110022', 'H10.1225'), ('10110023', 'H10.1225'), ('10110024', 'H10.1225'),
('10210019', 'H10.1225'), ('10210020', 'H10.1225'), ('10210021', 'H10.1225'), ('10210022', 'H10.1225'), ('10210023', 'H10.1225'),
('10110025', 'H10.1225'), ('10210024', 'H10.1225'), ('10110026', 'H10.1225'),

--===== Lớp Hóa 10 K005 - H10.0126 (Capacity: 25) =====
('10110027', 'H10.0126'), ('10110028', 'H10.0126'), ('10110029', 'H10.0126'), ('10110030', 'H10.0126'), ('10110031', 'H10.0126'),
('10210025', 'H10.0126'), ('10210026', 'H10.0126'), ('10210027', 'H10.0126'), ('10210028', 'H10.0126'), ('10210029', 'H10.0126'),
('10110032', 'H10.0126'), ('10210030', 'H10.0126'),

--===== Lớp Hóa 10 K006 - H10.0326 (Capacity: 25) =====
('10110033', 'H10.0326'), ('10110034', 'H10.0326'), ('10110035', 'H10.0326'), ('10110036', 'H10.0326'), ('10110037', 'H10.0326'),
('10210031', 'H10.0326'), ('10210032', 'H10.0326'), ('10210033', 'H10.0326'), ('10210034', 'H10.0326'), ('10210035', 'H10.0326'),

--===== Lớp Hóa 10 K007 - H10.0426 (Capacity: 30) =====
('10110038', 'H10.0426'), ('10110039', 'H10.0426'), ('10110040', 'H10.0426'), ('10110041', 'H10.0426'), ('10110042', 'H10.0426'),
('10210036', 'H10.0426'), ('10210037', 'H10.0426'), ('10210038', 'H10.0426'), ('10210039', 'H10.0426'), ('10210040', 'H10.0426'),
('10110043', 'H10.0426'), ('10210041', 'H10.0426'),

--===== Lớp Hóa 10 K008 - H10.0626 (Capacity: 25) =====
('10110044', 'H10.0626'), ('10110045', 'H10.0626'), ('10110046', 'H10.0626'), ('10110047', 'H10.0626'), ('10110048', 'H10.0626'),
('10110049', 'H10.0626'), ('10110050', 'H10.0626'), ('10210042', 'H10.0626'), ('10210043', 'H10.0626'), ('10210044', 'H10.0626'),
('10210045', 'H10.0626'), ('10210046', 'H10.0626'), ('10210047', 'H10.0626'), ('10210048', 'H10.0626'), ('10210049', 'H10.0626'), ('10210050', 'H10.0626'),


--========== Khối 11 (Học sinh Khóa 2009) ==========

--===== Lớp Hóa 11 K001 - H11.0425 (Capacity: 25) =====
('10109001', 'H11.0425'), ('10109002', 'H11.0425'), ('10109003', 'H11.0425'), ('10109004', 'H11.0425'), ('10109005', 'H11.0425'),
('10209001', 'H11.0425'), ('10209002', 'H11.0425'), ('10209003', 'H11.0425'), ('10209004', 'H11.0425'), ('10209005', 'H11.0425'),

--===== Lớp Hóa 11 K002 - H11.0825 (Capacity: 30) =====
('10109006', 'H11.0825'), ('10109007', 'H11.0825'), ('10109008', 'H11.0825'), ('10109009', 'H11.0825'), ('10109010', 'H11.0825'),
('10209006', 'H11.0825'), ('10209007', 'H11.0825'), ('10209008', 'H11.0825'), ('10209009', 'H11.0825'), ('10209010', 'H11.0825'),

--===== Lớp Hóa 11 K003 - H11.1125 (Capacity: 25) =====
('10109011', 'H11.1125'), ('10109012', 'H11.1125'), ('10109013', 'H11.1125'), ('10109014', 'H11.1125'), ('10109015', 'H11.1125'),
('10209011', 'H11.1125'), ('10209012', 'H11.1125'), ('10209013', 'H11.1125'), ('10209014', 'H11.1125'), ('10209015', 'H11.1125'),

--===== Lớp Hóa 11 K004 - H11.1225 (Capacity: 30) =====
('10109016', 'H11.1225'), ('10109017', 'H11.1225'), ('10109018', 'H11.1225'), ('10109019', 'H11.1225'), ('10109020', 'H11.1225'),
('10209016', 'H11.1225'), ('10209017', 'H11.1225'), ('10209018', 'H11.1225'), ('10209019', 'H11.1225'), ('10209020', 'H11.1225'),

--===== Lớp Hóa 11 K005 - H11.0126 (Capacity: 25) =====
('10109021', 'H11.0126'), ('10109022', 'H11.0126'), ('10109023', 'H11.0126'), ('10109024', 'H11.0126'), ('10109025', 'H11.0126'),
('10209021', 'H11.0126'), ('10209022', 'H11.0126'), ('10209023', 'H11.0126'), ('10209024', 'H11.0126'), ('10209025', 'H11.0126'),

--===== Lớp Hóa 11 K006 - H11.0326 (Capacity: 25) =====
('10109026', 'H11.0326'), ('10109027', 'H11.0326'), ('10109028', 'H11.0326'), ('10109029', 'H11.0326'), ('10109030', 'H11.0326'),
('10209026', 'H11.0326'), ('10209027', 'H11.0326'), ('10209028', 'H11.0326'), ('10209029', 'H11.0326'), ('10209030', 'H11.0326'),

--===== Lớp Hóa 11 K007 - H11.0426 (Capacity: 30) =====
('10109031', 'H11.0426'), ('10109032', 'H11.0426'), ('10109033', 'H11.0426'), ('10109034', 'H11.0426'), ('10109035', 'H11.0426'),
('10209031', 'H11.0426'), ('10209032', 'H11.0426'), ('10209033', 'H11.0426'), ('10209034', 'H11.0426'), ('10209035', 'H11.0426'),

--===== Lớp Hóa 11 K008 - H11.0626 (Capacity: 25) =====
('10109036', 'H11.0626'), ('10109037', 'H11.0626'), ('10109038', 'H11.0626'), ('10109039', 'H11.0626'), ('10109040', 'H11.0626'),
('10209036', 'H11.0626'), ('10209037', 'H11.0626'), ('10209038', 'H11.0626'), ('10209039', 'H11.0626'), ('10209040', 'H11.0626'),




--================ MÔN SINH ================

--========== Khối 10 (Học sinh Khóa 2010) ==========

--===== Lớp Sinh 10 K001 - S10.0425 (Capacity: 25) =====
('10110001', 'S10.0425'), ('10110002', 'S10.0425'), ('10110003', 'S10.0425'), ('10110004', 'S10.0425'), ('10110005', 'S10.0425'),
('10210001', 'S10.0425'), ('10210002', 'S10.0425'), ('10210003', 'S10.0425'), ('10210004', 'S10.0425'), ('10210005', 'S10.0425'),
('10110006', 'S10.0425'), ('10210006', 'S10.0425'),

--===== Lớp Sinh 10 K002 - S10.0825 (Capacity: 30) =====
('10110007', 'S10.0825'), ('10110008', 'S10.0825'), ('10110009', 'S10.0825'), ('10110010', 'S10.0825'), ('10110011', 'S10.0825'),
('10210007', 'S10.0825'), ('10210008', 'S10.0825'), ('10210009', 'S10.0825'), ('10210010', 'S10.0825'), ('10210011', 'S10.0825'),
('10110012', 'S10.0825'), ('10210012', 'S10.0825'), ('10110013', 'S10.0825'),

--===== Lớp Sinh 10 K003 - S10.1125 (Capacity: 25) =====
('10110014', 'S10.1125'), ('10110015', 'S10.1125'), ('10110016', 'S10.1125'), ('10110017', 'S10.1125'), ('10110018', 'S10.1125'),
('10210013', 'S10.1125'), ('10210014', 'S10.1125'), ('10210015', 'S10.1125'), ('10210016', 'S10.1125'), ('10210017', 'S10.1125'),
('10110019', 'S10.1125'), ('10210018', 'S10.1125'),

--===== Lớp Sinh 10 K004 - S10.1225 (Capacity: 30) =====
('10110020', 'S10.1225'), ('10110021', 'S10.1225'), ('10110022', 'S10.1225'), ('10110023', 'S10.1225'), ('10110024', 'S10.1225'),
('10210019', 'S10.1225'), ('10210020', 'S10.1225'), ('10210021', 'S10.1225'), ('10210022', 'S10.1225'), ('10210023', 'S10.1225'),
('10110025', 'S10.1225'), ('10210024', 'S10.1225'), ('10110026', 'S10.1225'),

--========== Khối 11 (Học sinh Khóa 2009) ==========

--===== Lớp Sinh 11 K001 - S11.0425 (Capacity: 25) =====
('10109001', 'S11.0425'), ('10109002', 'S11.0425'), ('10109003', 'S11.0425'), ('10109004', 'S11.0425'), ('10109005', 'S11.0425'),
('10209001', 'S11.0425'), ('10209002', 'S11.0425'), ('10209003', 'S11.0425'), ('10209004', 'S11.0425'), ('10209005', 'S11.0425'),

--===== Lớp Sinh 11 K002 - S11.0825 (Capacity: 30) =====
('10109006', 'S11.0825'), ('10109007', 'S11.0825'), ('10109008', 'S11.0825'), ('10109009', 'S11.0825'), ('10109010', 'S11.0825'),
('10209006', 'S11.0825'), ('10209007', 'S11.0825'), ('10209008', 'S11.0825'), ('10209009', 'S11.0825'), ('10209010', 'S11.0825'),

--===== Lớp Sinh 11 K003 - S11.1125 (Capacity: 25) =====
('10109011', 'S11.1125'), ('10109012', 'S11.1125'), ('10109013', 'S11.1125'), ('10109014', 'S11.1125'), ('10109015', 'S11.1125'),
('10209011', 'S11.1125'), ('10209012', 'S11.1125'), ('10209013', 'S11.1125'), ('10209014', 'S11.1125'), ('10209015', 'S11.1125'),



--================ CÁC LỚP NGOẠI NGỮ (Dành cho Cấp 2: Khóa 2011, 2012, 2013) ================

--========== TIẾNG NHẬT N5 ==========
--===== Lớp Tiếng Nhật N5 K001 - NN02.N5.0425 (Dành cho Khóa 2011 - Lớp 9) =====
('10111001', 'NN02.N5.0425'), ('10111002', 'NN02.N5.0425'), ('10111003', 'NN02.N5.0425'), ('10111004', 'NN02.N5.0425'), ('10111005', 'NN02.N5.0425'),
('10211001', 'NN02.N5.0425'), ('10211002', 'NN02.N5.0425'), ('10211003', 'NN02.N5.0425'), ('10211004', 'NN02.N5.0425'), ('10211005', 'NN02.N5.0425'),
('10111006', 'NN02.N5.0425'), ('10211006', 'NN02.N5.0425'),

--===== Lớp Tiếng Nhật N5 K002 - NN02.N5.0825 (Dành cho Khóa 2012 - Lớp 8) =====
('10112001', 'NN02.N5.0825'), ('10112002', 'NN02.N5.0825'), ('10112003', 'NN02.N5.0825'), ('10112004', 'NN02.N5.0825'), ('10112005', 'NN02.N5.0825'),
('10212001', 'NN02.N5.0825'), ('10212002', 'NN02.N5.0825'), ('10212003', 'NN02.N5.0825'), ('10212004', 'NN02.N5.0825'), ('10212005', 'NN02.N5.0825'),
('10112006', 'NN02.N5.0825'), ('10212006', 'NN02.N5.0825'),

--===== Lớp Tiếng Nhật N5 K003 - NN02.N5.1125 (Dành cho Khóa 2013 - Lớp 7) =====
('10113001', 'NN02.N5.1125'), ('10113002', 'NN02.N5.1125'), ('10113003', 'NN02.N5.1125'), ('10113004', 'NN02.N5.1125'), ('10113005', 'NN02.N5.1125'),
('10213001', 'NN02.N5.1125'), ('10213002', 'NN02.N5.1125'), ('10213003', 'NN02.N5.1125'), ('10213004', 'NN02.N5.1125'), ('10213005', 'NN02.N5.1125'),
('10113006', 'NN02.N5.1125'), ('10213006', 'NN02.N5.1125'),


--========== TIẾNG TRUNG HSK1 ==========
--===== Lớp Tiếng Trung HSK1 K001 - NN03.H1.0425 (Dành cho Khóa 2011 - Lớp 9) =====
('10111007', 'NN03.H1.0425'), ('10111008', 'NN03.H1.0425'), ('10111009', 'NN03.H1.0425'), ('10111010', 'NN03.H1.0425'), ('10111011', 'NN03.H1.0425'),
('10211007', 'NN03.H1.0425'), ('10211008', 'NN03.H1.0425'), ('10211009', 'NN03.H1.0425'), ('10211010', 'NN03.H1.0425'), ('10211011', 'NN03.H1.0425'),
('10111012', 'NN03.H1.0425'), ('10211012', 'NN03.H1.0425'),

--===== Lớp Tiếng Trung HSK1 K002 - NN03.H1.0825 (Dành cho Khóa 2012 - Lớp 8) =====
('10112007', 'NN03.H1.0825'), ('10112008', 'NN03.H1.0825'), ('10112009', 'NN03.H1.0825'), ('10112010', 'NN03.H1.0825'), ('10112011', 'NN03.H1.0825'),
('10212007', 'NN03.H1.0825'), ('10212008', 'NN03.H1.0825'), ('10212009', 'NN03.H1.0825'), ('10212010', 'NN03.H1.0825'), ('10212011', 'NN03.H1.0825'),
('10112012', 'NN03.H1.0825'), ('10212012', 'NN03.H1.0825'),

--===== Lớp Tiếng Trung HSK1 K003 - NN03.H1.1125 (Dành cho Khóa 2013 - Lớp 7) =====
('10113007', 'NN03.H1.1125'), ('10113008', 'NN03.H1.1125'), ('10113009', 'NN03.H1.1125'), ('10113010', 'NN03.H1.1125'), ('10113011', 'NN03.H1.1125'),
('10213007', 'NN03.H1.1125'), ('10213008', 'NN03.H1.1125'), ('10213009', 'NN03.H1.1125'), ('10213010', 'NN03.H1.1125'), ('10213011', 'NN03.H1.1125'),
('10113012', 'NN03.H1.1125'), ('10213012', 'NN03.H1.1125');
GO








-- Tạo bảng Attendance
IF OBJECT_ID('dbo.Attendance', 'U') IS NOT NULL DROP TABLE dbo.Attendance;
GO
CREATE TABLE Attendance
(
    AttendanceID INT IDENTITY(1,1) PRIMARY KEY,
    AccountID NVARCHAR(20) NOT NULL,
    ClassID NVARCHAR(20) NOT NULL,
    AttendanceDate DATE NOT NULL,
    Status NVARCHAR(20) NOT NULL,
    Note NVARCHAR(255) NULL,
    CONSTRAINT FK_Attendance_Account FOREIGN KEY (AccountID) REFERENCES accountList(Id),
    CONSTRAINT FK_Attendance_Class FOREIGN KEY (ClassID) REFERENCES Class(classID),
    CONSTRAINT UQ_Attendance UNIQUE (AccountID, ClassID, AttendanceDate)
);
GO
-- Dữ liệu mẫu Attendance
INSERT INTO Attendance (AccountID, ClassID, AttendanceDate, Status, Note)
VALUES
('10110038', 'T10.0426', '2026-03-10', N'Có mặt', N''),
('10110039', 'T10.0426', '2026-03-10', N'Vắng', N'Nghỉ có phép'),
('10210001', 'V10.0425', '2026-03-10', N'Muộn', N'Đến trễ 10 phút'),
('10110001', 'L10.0425', '2026-03-10', N'Có mặt', N'');
GO






-- Tạo bảng HọcPhí
IF OBJECT_ID('dbo.HocPhi', 'U') IS NOT NULL DROP TABLE dbo.HocPhi;
GO
CREATE TABLE HocPhi
(
    HocPhiID INT IDENTITY(1,1) PRIMARY KEY,
    AccountID NVARCHAR(20) NOT NULL,
    ClassID NVARCHAR(20) NOT NULL,
    TuitionMonth INT NOT NULL,
    TuitionYear INT NOT NULL,
    SoTien DECIMAL(18,0) NOT NULL,
    TrangThai NVARCHAR(30) NOT NULL DEFAULT N'Chưa đóng',
    NgayDong DATE NULL,
    GhiChu NVARCHAR(255) NULL,
    CONSTRAINT FK_HocPhi_Account FOREIGN KEY (AccountID) REFERENCES accountList(Id),
    CONSTRAINT FK_HocPhi_Class FOREIGN KEY (ClassID) REFERENCES Class(classID),
    CONSTRAINT UQ_HocPhi UNIQUE (AccountID, ClassID, TuitionMonth, TuitionYear)
);
GO
-- Dữ liệu mẫu Học phí
INSERT INTO HocPhi 
(AccountID, ClassID, TuitionMonth, TuitionYear, SoTien, TrangThai, NgayDong, GhiChu)
VALUES
-- ================= Lớp Toán 10 K002 (T10.0825) =================
('10110007', 'T10.0825', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10110008', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110009', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110010', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110011', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110012', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110013', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210007', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210008', 'T10.0825', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10210009', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210010', 'T10.0825', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10210011', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210012', 'T10.0825', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),

-- ================= Lớp Văn 10 K001 (V10.0425) =================
('10110001', 'V10.0425', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10110002', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110003', 'V10.0425', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10110004', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110005', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110026', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210001', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210002', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210003', 'V10.0425', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10210004', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210005', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210026', 'V10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),

-- ================= Lớp Lý 10 K001 (L10.0425) =================
('10110001', 'L10.0425', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10110002', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110003', 'L10.0425', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10110004', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110005', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10110006', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210001', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210002', 'L10.0425', 3, 2026, 500000, N'Đã đóng', '2026-03-05', N'Đóng đủ'),
('10210003', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210004', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210005', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL),
('10210006', 'L10.0425', 3, 2026, 500000, N'Chưa đóng', NULL, NULL);
GO





-- Các bảng Lương GV, Khoản Thu, Khoản Chi
-- Lương GV
IF OBJECT_ID('dbo.LuongGV', 'U') IS NOT NULL DROP TABLE dbo.LuongGV;
GO
CREATE TABLE LuongGV
(
    LuongID INT IDENTITY(1,1) PRIMARY KEY,
    TeacherID NVARCHAR(20) NOT NULL,
    SalaryMonth INT NOT NULL,
    SalaryYear INT NOT NULL,
    SoLopDay INT NOT NULL DEFAULT 0,
    SoBuoiDay INT NOT NULL DEFAULT 0,
    LuongCoBan DECIMAL(18,0) NOT NULL DEFAULT 0,
    Thuong DECIMAL(18,0) NOT NULL DEFAULT 0,
    Phat DECIMAL(18,0) NOT NULL DEFAULT 0,
    TongLuong DECIMAL(18,0) NOT NULL DEFAULT 0,
    TrangThai NVARCHAR(30) NOT NULL DEFAULT N'Chưa thanh toán',
    NgayThanhToan DATE NULL,
    GhiChu NVARCHAR(255) NULL,
    CONSTRAINT FK_LuongGV_Account FOREIGN KEY (TeacherID) REFERENCES accountList(Id),
    CONSTRAINT UQ_LuongGV UNIQUE (TeacherID, SalaryMonth, SalaryYear)
);
GO
INSERT INTO LuongGV (TeacherID, SalaryMonth, SalaryYear, SoLopDay, SoBuoiDay, LuongCoBan, Thuong, Phat, TongLuong, TrangThai, NgayThanhToan, GhiChu)
VALUES 
('T01', 3, 2026, 3, 20, 8000000, 500000, 0, 8500000, N'Chưa thanh toán', NULL, N'Lương tháng 3'),
('T02', 4, 2026, 3, 20, 8000000, 500000, 0, 8500000, N'Chưa thanh toán', NULL, N'Lương tháng 4'),
('T03', 5, 2026, 3, 20, 8000000, 500000, 0, 8500000, N'Chưa thanh toán', NULL, N'Lương tháng 5');
GO
-- Khoản Thu
IF OBJECT_ID('dbo.KhoanThu', 'U') IS NOT NULL DROP TABLE dbo.KhoanThu;
GO
CREATE TABLE KhoanThu
(
    ThuID INT IDENTITY(1,1) PRIMARY KEY,
    ThuMonth INT NOT NULL,
    ThuYear INT NOT NULL,
    LoaiThu NVARCHAR(100) NOT NULL,
    NoiDung NVARCHAR(255) NOT NULL,
    SoTien DECIMAL(18,0) NOT NULL,
    NgayThu DATE NOT NULL,
    GhiChu NVARCHAR(255) NULL
);
GO
INSERT INTO KhoanThu (ThuMonth, ThuYear, LoaiThu, NoiDung, SoTien, NgayThu, GhiChu)
VALUES
(3, 2026, N'Học phí', N'Thu học phí lớp Toán 11 K005', 4500000, '2026-03-10', N'Thu gộp nhiều học sinh'),
(3, 2026, N'Bán tài liệu', N'Bán giáo trình Tiếng Nhật N5', 850000, '2026-03-15', N'Lớp N5.0426'),
(3, 2026, N'Lệ phí thi', N'Thu lệ phí thi thử THPT Quốc Gia (Lần 1)', 3200000, '2026-03-22', N'Khối 12'),
(4, 2026, N'Học phí', N'Thu học phí lớp Văn 10 K007', 5000000, '2026-04-02', N'Thu gộp đầu tháng'),
(4, 2026, N'Học phí', N'Thu học phí lớp Tiếng Trung HSK1 K005', 3000000, '2026-04-05', N''),
(4, 2026, N'Bán tài liệu', N'Bán bộ sách tham khảo Hóa học cơ bản', 600000, '2026-04-10', N''),
(4, 2026, N'Thu khác', N'Thu tiền đồng phục trung tâm', 1500000, '2026-04-12', N'Size M, L');
GO

-- Khoản Chi
IF OBJECT_ID('dbo.KhoanChi', 'U') IS NOT NULL DROP TABLE dbo.KhoanChi;
GO
CREATE TABLE KhoanChi
(
    ChiID INT IDENTITY(1,1) PRIMARY KEY,
    ChiMonth INT NOT NULL,
    ChiYear INT NOT NULL,
    LoaiChi NVARCHAR(100) NOT NULL,
    NoiDung NVARCHAR(255) NOT NULL,
    SoTien DECIMAL(18,0) NOT NULL,
    NgayChi DATE NOT NULL,
    GhiChu NVARCHAR(255) NULL
);
GO
INSERT INTO KhoanChi (ChiMonth, ChiYear, LoaiChi, NoiDung, SoTien, NgayChi, GhiChu)
VALUES
(3, 2026, N'Thuê mặt bằng', N'Thanh toán tiền thuê mặt bằng tháng 3', 15000000, '2026-03-05', N'Cơ sở chính'),
(3, 2026, N'Bảo trì thiết bị', N'Bảo trì, vệ sinh 4 máy lạnh', 800000, '2026-03-15', N'Phòng học Tầng 1'),
(3, 2026, N'Marketing', N'Chạy quảng cáo Facebook tuyển sinh', 3000000, '2026-03-18', N'Chiến dịch khóa mùa hè'),
(3, 2026, N'Lương NV', N'Thanh toán lương nhân viên bảo vệ, tạp vụ', 12000000, '2026-03-30', N'Lương tháng 3'),
(4, 2026, N'Thuê mặt bằng', N'Thanh toán tiền thuê mặt bằng tháng 4', 15000000, '2026-04-05', N'Cơ sở chính'),
(4, 2026, N'Điện nước', N'Tiền điện nước trung tâm tháng 4', 1450000, '2026-04-10', N'Đã bao gồm VAT'),
(4, 2026, N'Trang thiết bị', N'Mua thêm 2 bảng từ trắng', 1800000, '2026-04-12', N'Phòng 201, 202'),
(4, 2026, N'Văn phòng phẩm', N'In ấn tài liệu thi thử khối 12', 1200000, '2026-04-15', N'In tại xưởng');
GO





-- ClassSchedule
IF OBJECT_ID('dbo.ClassSchedule', 'U') IS NOT NULL DROP TABLE dbo.ClassSchedule;
CREATE TABLE ClassSchedule (
    classID NVARCHAR(20) not null ,
    dayOfWeek INT not null,
    startTime TIME not null,
    endTime TIME not null,
    CONSTRAINT FK_Schedule_Class FOREIGN KEY (classID) REFERENCES Class(classID)
);
GO
-- Dữ liệu mẫu ClassSchedule
-- dayOfWeek: 1 = Monday, 2 = Tuesday, 3 = Wednesday, 4 = Thursday, 5 = Friday, 6 = Saturday
INSERT INTO ClassSchedule (classID, dayOfWeek, startTime, endTime)
VALUES
-- ================= TOÁN =================
('T10.1225', 1, '17:00:00', '19:00:00'), ('T10.1225', 4, '17:00:00', '19:00:00'),
('T10.0126', 2, '17:00:00', '19:00:00'), ('T10.0126', 5, '17:00:00', '19:00:00'),
('T10.0326', 3, '17:00:00', '19:00:00'), ('T10.0326', 6, '17:00:00', '19:00:00'),
('T10.0426', 1, '19:00:00', '21:00:00'), ('T10.0426', 4, '19:00:00', '21:00:00'),
('T10.0626', 2, '19:00:00', '21:00:00'), ('T10.0626', 5, '19:00:00', '21:00:00'),
('T11.1225', 3, '19:00:00', '21:00:00'), ('T11.1225', 6, '19:00:00', '21:00:00'),
('T11.0126', 1, '18:00:00', '20:00:00'), ('T11.0126', 4, '18:00:00', '20:00:00'),
('T11.0326', 2, '18:00:00', '20:00:00'), ('T11.0326', 5, '18:00:00', '20:00:00'),
('T11.0426', 3, '18:00:00', '20:00:00'), ('T11.0426', 6, '18:00:00', '20:00:00'),
('T11.0626', 1, '20:00:00', '22:00:00'), ('T11.0626', 4, '20:00:00', '22:00:00'),
('T12.1225', 2, '20:00:00', '22:00:00'), ('T12.1225', 5, '20:00:00', '22:00:00'),
('T12.0126', 3, '20:00:00', '22:00:00'), ('T12.0126', 6, '20:00:00', '22:00:00'),
('T12.0326', 1, '17:00:00', '19:00:00'), ('T12.0326', 4, '17:00:00', '19:00:00'),
('T12.0426', 2, '17:00:00', '19:00:00'), ('T12.0426', 5, '17:00:00', '19:00:00'),
('T12.0626', 3, '17:00:00', '19:00:00'), ('T12.0626', 6, '17:00:00', '19:00:00'),




-- ================= VĂN =================
('V10.1225', 1, '19:00:00', '21:00:00'), ('V10.1225', 4, '19:00:00', '21:00:00'),
('V10.0126', 2, '19:00:00', '21:00:00'), ('V10.0126', 5, '19:00:00', '21:00:00'),
('V10.0326', 3, '19:00:00', '21:00:00'), ('V10.0326', 6, '19:00:00', '21:00:00'),
('V10.0426', 1, '18:00:00', '20:00:00'), ('V10.0426', 4, '18:00:00', '20:00:00'),
('V10.0626', 2, '18:00:00', '20:00:00'), ('V10.0626', 5, '18:00:00', '20:00:00'),
('V11.1225', 3, '18:00:00', '20:00:00'), ('V11.1225', 6, '18:00:00', '20:00:00'),
('V11.0126', 1, '20:00:00', '22:00:00'), ('V11.0126', 4, '20:00:00', '22:00:00'),
('V11.0326', 2, '20:00:00', '22:00:00'), ('V11.0326', 5, '20:00:00', '22:00:00'),
('V11.0426', 3, '20:00:00', '22:00:00'), ('V11.0426', 6, '20:00:00', '22:00:00'),
('V11.0626', 1, '17:00:00', '19:00:00'), ('V11.0626', 4, '17:00:00', '19:00:00'),
('V12.1225', 2, '17:00:00', '19:00:00'), ('V12.1225', 5, '17:00:00', '19:00:00'),
('V12.0126', 3, '17:00:00', '19:00:00'), ('V12.0126', 6, '17:00:00', '19:00:00'),
('V12.0326', 1, '19:00:00', '21:00:00'), ('V12.0326', 4, '19:00:00', '21:00:00'),
('V12.0426', 2, '19:00:00', '21:00:00'), ('V12.0426', 5, '19:00:00', '21:00:00'),
('V12.0626', 3, '19:00:00', '21:00:00'), ('V12.0626', 6, '19:00:00', '21:00:00'),




-- ================= HÓA =================
('H10.1225', 1, '18:00:00', '20:00:00'), ('H10.1225', 4, '18:00:00', '20:00:00'),
('H10.0126', 2, '18:00:00', '20:00:00'), ('H10.0126', 5, '18:00:00', '20:00:00'),
('H10.0326', 3, '18:00:00', '20:00:00'), ('H10.0326', 6, '18:00:00', '20:00:00'),
('H10.0426', 1, '20:00:00', '22:00:00'), ('H10.0426', 4, '20:00:00', '22:00:00'),
('H10.0626', 2, '20:00:00', '22:00:00'), ('H10.0626', 5, '20:00:00', '22:00:00'),
('H11.1225', 3, '20:00:00', '22:00:00'), ('H11.1225', 6, '20:00:00', '22:00:00'),
('H11.0126', 1, '17:00:00', '19:00:00'), ('H11.0126', 4, '17:00:00', '19:00:00'),
('H11.0326', 2, '17:00:00', '19:00:00'), ('H11.0326', 5, '17:00:00', '19:00:00'),
('H11.0426', 3, '17:00:00', '19:00:00'), ('H11.0426', 6, '17:00:00', '19:00:00'),
('H11.0626', 1, '19:00:00', '21:00:00'), ('H11.0626', 4, '19:00:00', '21:00:00'),
('H12.1225', 2, '19:00:00', '21:00:00'), ('H12.1225', 5, '19:00:00', '21:00:00'),
('H12.0126', 3, '19:00:00', '21:00:00'), ('H12.0126', 6, '19:00:00', '21:00:00'),
('H12.0326', 1, '18:00:00', '20:00:00'), ('H12.0326', 4, '18:00:00', '20:00:00'),
('H12.0426', 2, '18:00:00', '20:00:00'), ('H12.0426', 5, '18:00:00', '20:00:00'),
('H12.0626', 3, '18:00:00', '20:00:00'), ('H12.0626', 6, '18:00:00', '20:00:00'),




-- ================= LÝ =================
('L10.1225', 1, '20:00:00', '22:00:00'), ('L10.1225', 4, '20:00:00', '22:00:00'),
('L10.0126', 2, '20:00:00', '22:00:00'), ('L10.0126', 5, '20:00:00', '22:00:00'),
('L10.0326', 3, '20:00:00', '22:00:00'), ('L10.0326', 6, '20:00:00', '22:00:00'),
('L10.0426', 1, '17:00:00', '19:00:00'), ('L10.0426', 4, '17:00:00', '19:00:00'),
('L10.0626', 2, '17:00:00', '19:00:00'), ('L10.0626', 5, '17:00:00', '19:00:00'),
('L11.1225', 3, '17:00:00', '19:00:00'), ('L11.1225', 6, '17:00:00', '19:00:00'),
('L11.0126', 1, '19:00:00', '21:00:00'), ('L11.0126', 4, '19:00:00', '21:00:00'),
('L11.0326', 2, '19:00:00', '21:00:00'), ('L11.0326', 5, '19:00:00', '21:00:00'),
('L11.0426', 3, '19:00:00', '21:00:00'), ('L11.0426', 6, '19:00:00', '21:00:00'),
('L11.0626', 1, '18:00:00', '20:00:00'), ('L11.0626', 4, '18:00:00', '20:00:00'),
('L12.1225', 2, '18:00:00', '20:00:00'), ('L12.1225', 5, '18:00:00', '20:00:00'),
('L12.0126', 3, '18:00:00', '20:00:00'), ('L12.0126', 6, '18:00:00', '20:00:00'),
('L12.0326', 1, '20:00:00', '22:00:00'), ('L12.0326', 4, '20:00:00', '22:00:00'),
('L12.0426', 2, '20:00:00', '22:00:00'), ('L12.0426', 5, '20:00:00', '22:00:00'),
('L12.0626', 3, '20:00:00', '22:00:00'), ('L12.0626', 6, '20:00:00', '22:00:00'),




-- ================= SINH =================
('S10.1225', 1, '17:00:00', '19:00:00'), ('S10.1225', 4, '17:00:00', '19:00:00'),
('S10.0126', 2, '17:00:00', '19:00:00'), ('S10.0126', 5, '17:00:00', '19:00:00'),
('S10.0326', 3, '17:00:00', '19:00:00'), ('S10.0326', 6, '17:00:00', '19:00:00'),
('S10.0426', 1, '19:00:00', '21:00:00'), ('S10.0426', 4, '19:00:00', '21:00:00'),
('S10.0626', 2, '19:00:00', '21:00:00'), ('S10.0626', 5, '19:00:00', '21:00:00'),
('S11.1225', 3, '19:00:00', '21:00:00'), ('S11.1225', 6, '19:00:00', '21:00:00'),
('S11.0126', 1, '18:00:00', '20:00:00'), ('S11.0126', 4, '18:00:00', '20:00:00'),
('S11.0326', 2, '18:00:00', '20:00:00'), ('S11.0326', 5, '18:00:00', '20:00:00'),
('S11.0426', 3, '18:00:00', '20:00:00'), ('S11.0426', 6, '18:00:00', '20:00:00'),
('S11.0626', 1, '20:00:00', '22:00:00'), ('S11.0626', 4, '20:00:00', '22:00:00'),
('S12.1225', 2, '20:00:00', '22:00:00'), ('S12.1225', 5, '20:00:00', '22:00:00'),
('S12.0126', 3, '20:00:00', '22:00:00'), ('S12.0126', 6, '20:00:00', '22:00:00'),
('S12.0326', 1, '17:00:00', '19:00:00'), ('S12.0326', 4, '17:00:00', '19:00:00'),
('S12.0426', 2, '17:00:00', '19:00:00'), ('S12.0426', 5, '17:00:00', '19:00:00'),
('S12.0626', 3, '17:00:00', '19:00:00'), ('S12.0626', 6, '17:00:00', '19:00:00'),




-- ================= TIẾNG ANH =================
('NN01.10.1225', 1, '19:00:00', '21:00:00'), ('NN01.10.1225', 4, '19:00:00', '21:00:00'),
('NN01.10.0126', 2, '19:00:00', '21:00:00'), ('NN01.10.0126', 5, '19:00:00', '21:00:00'),
('NN01.10.0326', 3, '19:00:00', '21:00:00'), ('NN01.10.0326', 6, '19:00:00', '21:00:00'),
('NN01.10.0426', 1, '18:00:00', '20:00:00'), ('NN01.10.0426', 4, '18:00:00', '20:00:00'),
('NN01.10.0626', 2, '18:00:00', '20:00:00'), ('NN01.10.0626', 5, '18:00:00', '20:00:00'),
('NN01.11.1225', 3, '18:00:00', '20:00:00'), ('NN01.11.1225', 6, '18:00:00', '20:00:00'),
('NN01.11.0126', 1, '20:00:00', '22:00:00'), ('NN01.11.0126', 4, '20:00:00', '22:00:00'),
('NN01.11.0326', 2, '20:00:00', '22:00:00'), ('NN01.11.0326', 5, '20:00:00', '22:00:00'),
('NN01.11.0426', 3, '20:00:00', '22:00:00'), ('NN01.11.0426', 6, '20:00:00', '22:00:00'),
('NN01.11.0626', 1, '17:00:00', '19:00:00'), ('NN01.11.0626', 4, '17:00:00', '19:00:00'),
('NN01.12.1225', 2, '17:00:00', '19:00:00'), ('NN01.12.1225', 5, '17:00:00', '19:00:00'),
('NN01.12.0126', 3, '17:00:00', '19:00:00'), ('NN01.12.0126', 6, '17:00:00', '19:00:00'),
('NN01.12.0326', 1, '19:00:00', '21:00:00'), ('NN01.12.0326', 4, '19:00:00', '21:00:00'),
('NN01.12.0426', 2, '19:00:00', '21:00:00'), ('NN01.12.0426', 5, '19:00:00', '21:00:00'),
('NN01.12.0626', 3, '19:00:00', '21:00:00'), ('NN01.12.0626', 6, '19:00:00', '21:00:00'),



-- ================= TIẾNG NHẬT =================
('NN02.N5.1225', 1, '18:00:00', '20:00:00'), ('NN02.N5.1225', 4, '18:00:00', '20:00:00'),
('NN02.N5.0126', 2, '18:00:00', '20:00:00'), ('NN02.N5.0126', 5, '18:00:00', '20:00:00'),
('NN02.N5.0326', 3, '18:00:00', '20:00:00'), ('NN02.N5.0326', 6, '18:00:00', '20:00:00'),
('NN02.N5.0426', 1, '20:00:00', '22:00:00'), ('NN02.N5.0426', 4, '20:00:00', '22:00:00'),
('NN02.N5.0626', 2, '20:00:00', '22:00:00'), ('NN02.N5.0626', 5, '20:00:00', '22:00:00'),
('NN02.N4.1225', 3, '20:00:00', '22:00:00'), ('NN02.N4.1225', 6, '20:00:00', '22:00:00'),
('NN02.N4.0126', 1, '17:00:00', '19:00:00'), ('NN02.N4.0126', 4, '17:00:00', '19:00:00'),
('NN02.N4.0326', 2, '17:00:00', '19:00:00'), ('NN02.N4.0326', 5, '17:00:00', '19:00:00'),
('NN02.N4.0426', 3, '17:00:00', '19:00:00'), ('NN02.N4.0426', 6, '17:00:00', '19:00:00'),
('NN02.N4.0626', 1, '19:00:00', '21:00:00'), ('NN02.N4.0626', 4, '19:00:00', '21:00:00'),
('NN02.N3.1225', 2, '19:00:00', '21:00:00'), ('NN02.N3.1225', 5, '19:00:00', '21:00:00'),
('NN02.N3.0126', 3, '19:00:00', '21:00:00'), ('NN02.N3.0126', 6, '19:00:00', '21:00:00'),
('NN02.N3.0326', 1, '18:00:00', '20:00:00'), ('NN02.N3.0326', 4, '18:00:00', '20:00:00'),
('NN02.N3.0426', 2, '18:00:00', '20:00:00'), ('NN02.N3.0426', 5, '18:00:00', '20:00:00'),
('NN02.N3.0626', 3, '18:00:00', '20:00:00'), ('NN02.N3.0626', 6, '18:00:00', '20:00:00'),



-- ================= TIẾNG TRUNG =================
('NN03.H1.1225', 1, '20:00:00', '22:00:00'), ('NN03.H1.1225', 4, '20:00:00', '22:00:00'),
('NN03.H1.0126', 2, '20:00:00', '22:00:00'), ('NN03.H1.0126', 5, '20:00:00', '22:00:00'),
('NN03.H1.0326', 3, '20:00:00', '22:00:00'), ('NN03.H1.0326', 6, '20:00:00', '22:00:00'),
('NN03.H1.0426', 1, '17:00:00', '19:00:00'), ('NN03.H1.0426', 4, '17:00:00', '19:00:00'),
('NN03.H1.0626', 2, '17:00:00', '19:00:00'), ('NN03.H1.0626', 5, '17:00:00', '19:00:00'),
('NN03.H2.1225', 3, '17:00:00', '19:00:00'), ('NN03.H2.1225', 6, '17:00:00', '19:00:00'),
('NN03.H2.0126', 1, '19:00:00', '21:00:00'), ('NN03.H2.0126', 4, '19:00:00', '21:00:00'),
('NN03.H2.0326', 2, '19:00:00', '21:00:00'), ('NN03.H2.0326', 5, '19:00:00', '21:00:00'),
('NN03.H2.0426', 3, '19:00:00', '21:00:00'), ('NN03.H2.0426', 6, '19:00:00', '21:00:00'),
('NN03.H2.0626', 1, '18:00:00', '20:00:00'), ('NN03.H2.0626', 4, '18:00:00', '20:00:00'),
('NN03.H3.1225', 2, '18:00:00', '20:00:00'), ('NN03.H3.1225', 5, '18:00:00', '20:00:00'),
('NN03.H3.0126', 3, '18:00:00', '20:00:00'), ('NN03.H3.0126', 6, '18:00:00', '20:00:00'),
('NN03.H3.0326', 1, '20:00:00', '22:00:00'), ('NN03.H3.0326', 4, '20:00:00', '22:00:00'),
('NN03.H3.0426', 2, '20:00:00', '22:00:00'), ('NN03.H3.0426', 5, '20:00:00', '22:00:00'),
('NN03.H3.0626', 3, '20:00:00', '22:00:00'), ('NN03.H3.0626', 6, '20:00:00', '22:00:00');




-- Tạo bảng Đơn đăng ký (Registration) với Khóa chính kết hợp
IF OBJECT_ID('dbo.Registration', 'U') IS NOT NULL DROP TABLE dbo.Registration;
GO
CREATE TABLE Registration
(
    AccountID NVARCHAR(20) NOT NULL,
    ClassID NVARCHAR(20) NOT NULL,
    RegistrationDate DATE NOT NULL,
    Status NVARCHAR(30) NOT NULL DEFAULT N'Chờ duyệt',
    Note NVARCHAR(255) NULL,
    
    -- Đặt AccountID và ClassID làm khóa chính kết hợp
    PRIMARY KEY (AccountID, ClassID),
    
    CONSTRAINT FK_Registration_Account FOREIGN KEY (AccountID) REFERENCES accountList(Id),
    CONSTRAINT FK_Registration_Class FOREIGN KEY (ClassID) REFERENCES Class(classID)
);
GO

-- Dữ liệu mẫu bảng Đơn đăng ký phân loại theo từng Khóa năm sinh
INSERT INTO Registration (AccountID, ClassID, RegistrationDate, Status, Note)
VALUES
-- KHÓA 2009 ( Lớp 11 )
('10109003', 'T11.0825', '2026-03-20', N'Chờ duyệt', N'Đăng ký vào lớp Toán 11'),
('10209004', 'V11.0825', '2026-03-21', N'Chờ duyệt', N'Đăng ký vào lớp Văn 11'),
('10209005', 'NN01.10.0626', '2026-03-23', N'Chờ duyệt', N'Đăng ký vào lớp Anh Văn'),

-- KHÓA 2010 ( Lớp 10 )
('10110001', 'T10.0426', '2026-03-20', N'Chờ duyệt', N'Đăng ký vào lớp Toán 10'),
('10210002', 'L10.0425', '2026-03-21', N'Chờ duyệt', N'Đăng ký vào lớp Lý 10'),
('10210006', 'NN02.N5.0425', '2026-03-25', N'Chờ duyệt', N'Đăng ký vào lớp Tiếng Nhật N5'),

-- KHÓA 2011 ( Lớp 9 )
('10111001', 'NN01.10.0426', '2026-03-22', N'Chờ duyệt', N'Đăng ký vào lớp Tiếng Anh'),
('10211002', 'T10.0626', '2026-03-23', N'Chờ duyệt', N'Đăng ký học hè lớp Toán 10'),
('10111004', 'NN03.H1.0425', '2026-03-24', N'Chờ duyệt', N'Đăng ký Tiếng Trung HSK1'),

-- KHÓA 2012 ( Lớp 8 )
('10112001', 'NN01.10.0825', '2026-03-20', N'Chờ duyệt', N'Đăng ký lớp Giao tiếp Tiếng Anh'),
('10212003', 'NN02.N5.0326', '2026-03-21', N'Chờ duyệt', N'Đăng ký lớp Tiếng Nhật N5'),

-- KHÓA 2013 ( Lớp 7 )
('10113002', 'NN01.10.0825', '2026-03-22', N'Chờ duyệt', N'Đăng ký vào lớp Tiếng Anh'),
('10213005', 'NN03.H1.0425', '2026-03-23', N'Chờ duyệt', N'Đăng ký vào lớp Tiếng Trung HSK1');
GO



CREATE TABLE Diem
(
    DiemID INT IDENTITY(1,1) PRIMARY KEY,
    AccountID NVARCHAR(20) NOT NULL,
    ClassID NVARCHAR(20) NOT NULL,
    Diem FLOAT NULL,
    NhanXet NVARCHAR(255) NULL,

    CONSTRAINT FK_Diem_Account FOREIGN KEY (AccountID) REFERENCES accountList(Id),
    CONSTRAINT FK_Diem_Class FOREIGN KEY (ClassID) REFERENCES Class(classID),

    CONSTRAINT UQ_Diem UNIQUE (AccountID, ClassID)
);
GO

INSERT INTO Diem (AccountID, ClassID, Diem, NhanXet)
VALUES
('10110038', 'T10.0426', 8.5, N'Học tốt'),
('10110039', 'T10.0426', 7.0, N'Cần chăm chỉ hơn'),
('10210001', 'V10.0425', 9.0, N'Viết bài rất tốt'),
('10110001', 'L10.0425', 8.0, N'Hiểu bài, làm tốt');
GO